package jp.co.sint.webshop.web.log.back;

import java.util.ArrayList;
import java.util.List;
import java.util.ListResourceBundle;

/**
 * 管理側アクセスログに出力するオペレーションコードとアクション名の一覧<br />
 * 本クラスで定義されたオペレーションが管理側アクセスログとして出力される<br />
 * 
 * @author System Integrator Corp.
 */
public class OperationName_zh_CN extends ListResourceBundle {

  private static final Object[][] COMMON = new Object[][] {
      {
          /** ログイン認証処理 */
          "0101011001", "登入认证处理"
      }, {
          /** ログイン初期表示処理 */
          "0101011002", "登入初期表示处理"
      }, {
          /** ダッシュボード初期表示処理 */
          "0101021001", "控制板初期表示处理"
      }, {
          /** ログアウト初期表示処理 */
          "0101031001", "登出初期处理"
      },
  };

  private static final Object[][] ORDER = new Object[][] {
      {
          /** 新規受注登録(商品選択)カート追加処理 */
          "1102011001", "新接受订货登录(商品选择)购物车追加处理"
      }, {
          /** 新規受注登録(商品選択)再計算処理 */
          "1102011002", "新接受订货登录(商品选择)再计算处理"
      }, {
          /** 新規受注登録(商品選択)カートクリア処理 */
          "1102011003", "新接受订货登录(商品选择)购物车清除处理"
      }, {
          /** 新規受注登録(商品選択)初期表示処理 */
          "1102011004", "新接受订货登录(商品选择)初期表示处理"
      }, {
          /** 新規受注登録(商品選択)遷移処理 */
          "1102011005", "新接受订货登录(商品选择)变迁处理"
      }, {
          /** 新規受注登録(商品選択)カート削除処理 */
          "1102011006", "新接受订货登录(商品选择)购物车删除处理"
      }, {
          /** 新規受注登録(商品選択)検索処理 */
          "1102011007", "新接受订货登录(商品选择)检索处理"
      }, {
          /** 新規受注登録（顧客選択）初期表示処理 */
          "1102012001", "新接受订货登录（客户选择）初期表示处理"
      }, {
          /** 新規受注登録（顧客選択）遷移処理 */
          "1102012002", "新接受订货登录（客户选择）变迁处理"
      }, {
          /** 新規受注登録（顧客選択）検索処理 */
          "1102012003", "新接受订货登录（客户选择）检索处理"
      }, {
          /** 新規受注登録(配送先設定)配送先追加処理 */
          "1102013001", "新接受订货登录（客户选择）发送处追加处理"
      }, {
          /** 新規受注登録(配送先設定)アドレス追加処理 */
          "1102013002", "新接受订货登录(发送处设定)地址追加处理"
      }, {
          /** 新規受注登録(配送先設定)再計算処理 */
          "1102013003", "新接受订货登录(发送处设定)再计算处理"
      }, {
          /** 新規受注登録(配送先設定)初期表示処理 */
          "1102013004", "新接受订货登录(发送处设定)初期表示处理"
      }, {
          /** 新規受注登録(配送先設定)遷移処理 */
          "1102013005", "新接受订货登录(发送处设定)变迁处理"
      }, {
          /** 新規受注登録(配送先設定)商品削除処理 */
          "1102013006", "新接受订货登录(发送处设定)商品删除处理"
      }, {
          /** 新規受注登録(配送先設定)配送先削除処理 */
          "1102013007", "新接受订货登录(发送处设定)发送处删除处理"
      // soukai add 2012/01/10 ob start
      }, {
          /** 新規受注登録(配送先設定)支付方式指定 */
          "1102013008", "新接受订货登录(发送处设定)支付方式指定"
      }, {
          /** 新規受注登録(配送先設定)优惠设定 */
          "1102013009", "新接受订货登录(发送处设定)优惠设定"
      // soukai add 2012/01/10 ob end
      }, {
          /** 新規受注登録(決済方法指定)再計算処理 */
          "1102015001", "新接受订货登录(结算方法指定)再计算处理"
      }, {
          /** 新規受注登録(決済方法指定)初期表示処理 */
          "1102015002", "新接受订货登录(结算方法指定)初期表示处理"
      }, {
          /** 新規受注登録(決済方法指定)遷移処理 */
          "1102015003", "新接受订货登录(结算方法指定)变迁处理"
      }, {
          /** 新規受注登録(確認)初期表示処理 */
          "1102016001", "新接受订货登录(确认)初期表示处理"
      }, {
          /** 新規受注登録(確認)遷移処理 */
          "1102016002", "新接受订货登录(确认)变迁处理"
      }, {
          /** 新規受注登録(確認)登録処理 */
          "1102016003", "新接受订货登录(确认)登录处理"
      }, {
          /** 新規受注登録(完了画面)初期表示処理 */
          "1102017001", "新接受订货登录(完成画面)初期表示处理"
      }, {
          /** 新規受注登録（顧客登録）戻る処理 */
          "1102019001", "新接受订货登录（顾客登录）返回处理"
      }, {
          /** 新規受注登録（顧客登録）確認処理 */
          "1102019002", "新接受订货登录（顾客登录）确认处理"
      }, {
          /** 新規受注登録（顧客登録）初期表示処理 */
          "1102019003", "新接受订货登录（顾客登录）初期表示处理"
      }, {
          /** 新規受注登録（顧客登録）登録処理 */
          "1102019004", "新接受订货登录（顾客登录）登录处理"
      // soukai add 2012/01/10 ob start
      }, {
          /** 新規受注登録（收货地址登录）初期表示処理 */
          "1102020001", "新接受订货登录（收货地址登录）初期表示处理"
      }, {
          /** 新規受注登録（收货地址登录）登録処理 */
          "1102020002", "新接受订货登录（收货地址登录）登录处理"
      // soukai add 2012/01/10 ob end
      }, {
          /** 受注入金管理出力処理 */
          "1102021001", "接受订货入款管理输出处理"
      }, {
          /** 受注入金管理初期表示処理 */
          "1102021002", "接受订货入款管理初期表示处理"
      }, {
          /** 受注入金管理遷移明細処理 */
          "1102021003", "接受订货入款管理变迁明细处理"
      }, {
          /** 受注入金管理支払情報登録処理 */
          "1102021004", "接受订货入款管理支付情报登录处理"
      }, {
          /** 受注入金管理支払情報リセット処理 */
          "1102021005", "接受订货入款管理支付情报重置处理"
      }, {
          /** 受注入金管理検索処理 */
          "1102021006", "接受订货入款管理检索处理"
      }, {
          /** 受注入金管理検索戻る処理 */
          "1102021007", "接受订货入款管理检索返回处理"
      }, {
          /** 受注入金管理入金確認メール送信処理 */
          "1102021008", "接受订货入款管理入款确认邮件送信处理"
      }, {
          /** 受注入金管理入金督促メール送信処理 */
          "1102021009", "接受订货入款管理入款督促邮件送信处理"
      }, {
          /** 受注管理明細受注キャンセル処理 */
          "1102022001", "接受订货管理明细接受订货取消处理"
      }, {
          /** 受注管理明細入金日クリア処理 */
          "1102022002", "接受订货管理明细入款日清除处理"
      }, {
          /** 受注管理明細初期表示処理 */
          "1102022003", "接受订货管理明细初期表示处理"
      }, {
          /** 受注管理明細受注修正遷移処理 */
          "1102022004", "接受订货管理明细接受订货修正变迁处理"
      }, {
          /** 受注管理明細受注返品遷移処理 */
          "1102022005", "接受订货管理明细接受订货退货变迁处理"
      }, {
          /** 受注管理明細入金日設定処理 */
          "1102022006", "接受订货管理明细入款日设定处理"
      }, {
          /** 受注管理明細更新処理 */
          "1102022007", "接受订货管理明细更新处理"
      // soukai add 2012/03/28 ob start
      }, {
          /** 受注管理明細更新処理 */
          "1102022008", "接受订货管理明细配送希望日期选择处理"
      // soukai add 2012/03/28 ob end
      }, {
          /** 受注修正商品追加処理 */
          "1102023001", "接受订货修正商品追加处理"
      }, {
          /** 受注修正商品クリア処理 */
          "1102023002", "接受订货修正商品清楚处理"
      }, {
          /** 受注修正再計算処理 */
          "1102023003", "接受订货修正再计算处理"
      }, {
          /** 受注修正再計算ポイント処理 */
          "1102023004", "接受订货修正再计算积分处理"
      }, {
          /** 受注修正初期表示処理 */
          "1102023005", "接受订货修正初期表示处理"
      }, {
          /** 受注修正遷移確認処理 */
          "1102023006", "接受订货修正变迁确认处理"
      }, {
          /** 受注修正入金遷移処理 */
          "1102023007", "接受订货修正入款变迁处理"
      }, {
          /** 受注修正出荷遷移処理 */
          "1102023008", "接受订货修正出货变迁处理"
      }, {
          /** 受注修正登録処理 */
          "1102023009", "接受订货修正登录处理"
      // soukai add 2012/01/12 ob start
      }, {
          /** 受注修正支払設定処理 */
          "1102023010", "接受订货修正支付设定处理"
      }, {
          /** 受注修正クーポン使用処理 */
          "1102023011", "接受订货修正优惠设定处理"
      // soukai add 2012/01/12 ob end
      // 2012/12/07 ob add start
      }, {
          /** 受注修正割引券使用処理 */
          "1102023012", "接受订货修正折扣券设定处理"
      // 2012/12/07 ob add end
      }, {
          /** 受注返品戻る処理 */
          "1102026001", "接受订货退货返回处理"
      }, {
          /** 受注返品確認処理 */
          "1102026002", "接受订货退货确认处理"
      }, {
          /** 受注返品返品削除処理 */
          "1102026003", "接受订货退货退货删除处理"
      }, {
          /** 受注返品初期表示処理 */
          "1102026004", "接受订货退货初期表示处理"
      }, {
          /** 受注返品登録処理 */
          "1102026005", "接受订货退货登录处理"
      }, {
          /** 出荷管理出荷実績削除処理 */
          "1102041001", "出货管理出货实绩删除处理"
      }, {
          /** 出荷管理出荷指示削除処理 */
          "1102041002", "出货管理出货指示删除处理"
      }, {
          /** 出荷管理出力処理 */
          "1102041003", "出货管理输出处理"
      }, {
          /** 出荷管理取込処理 */
          "1102041004", "出货管理取入处理"
      }, {
          /** 出荷管理初期表示処理 */
          "1102041005", "出货管理初期表示处理"
      }, {
          /** 出荷管理遷移処理 */
          "1102041006", "出货管理变迁处理"
      }, {
          /** 出荷管理出荷実績登録処理 */
          "1102041007", "出货管理出货实绩登录处理"
      }, {
          /** 出荷管理検索処理 */
          "1102041008", "出货管理检索处理"
      }, {
          /** 出荷管理検索戻る処理 */
          "1102041009", "出货管理检索返回处理"
      }, {
          /** 出荷管理ショップ選択処理 */
          "1102041010", "出货管理店铺选择处理"
      }, {
          /** 出荷管理出荷報告メール送信処理 */
          "1102041011", "出货管理出货报告邮件送信处理"
      }, {
          /** 出荷管理明細初期表示処理 */
          "1102042001", "出货管理明细初期表示处理"
      }, {
          /** 出荷管理明細遷移処理 */
          "1102042002", "出货管理明细变迁处理"
      }, {
          /** 出荷管理明細出荷指示登録処理 */
          "1102042003", "出货管理明细出货指示登录处理"
      }, {
          /** 出荷管理明細更新処理 */
          "1102042004", "出货管理明细更新处理"
      },
  };

  private static final Object[][] CUSTOMER = new Object[][] {
      {
          /** 顧客マスタ出力処理 */
          "2103011001", "顾客管理输出处理"
      }, {
          /** 顧客マスタ初期表示処理 */
          "2103011002", "顾客管理初期表示处理"
      }, {
          /** 顧客マスタ遷移処理 */
          "2103011003", "顾客管理变迁处理"
      }, {
          /** 顧客マスタ検索処理 */
          "2103011004", "顾客管理检索处理"
      }, {
          /** 顧客マスタ検索戻る処理 */
          "2103011005", "顾客管理检索返回处理"
      }, {
          /** 顧客マスタ退会処理 */
          "2103011006", "顾客管理退会处理"
      }, {
          /** 顧客登録戻る処理 */
          "2103012001", "顾客登录返回处理"
      }, {
          /** 顧客登録確認処理 */
          "2103012002", "顾客登录确认处理"
      }, {
          /** 顧客登録初期表示処理 */
          "2103012003", "顾客登录初期表示处理"
      }, {
          /** 顧客登録遷移処理 */
          "2103012004", "顾客登录变迁处理"
      }, {
          /** 顧客登録登録処理 */
          "2103012005", "顾客登录登录处理"
      }, {
          /** 顧客登録更新処理 */
          "2103012006", "顾客登录更新处理"
      }, {
          /** 顧客登録退会処理 */
          "2103012007", "顾客登录退会处理"
      }, {
          /** ポイント履歴完了処理 */
          "2103014001", "积分履历完成处理"
      }, {
          /** ポイント履歴削除処理 */
          "2103014002", "积分履历删除处理"
      }, {
          /** ポイント履歴初期表示処理 */
          "2103014003", "积分履历初期表示处理"
      }, {
          /** ポイント履歴登録処理 */
          "2103014004", "积分履历登录处理"
      }, {
          /** ポイント履歴検索処理 */
          "2103014005", "积分履历检索处理"
      }, {
          /** 注文履歴初期表示処理 */
          "2103015001", "订购履历初期表示处理"
      }, {
          /** 注文履歴初期表示戻る処理 */
          "2103015002", "订购履历初期表示返回处理"
      }, {
          /** 注文履歴遷移処理 */
          "2103015003", "订购履历变迁处理"
      }, {
          /** アドレス帳一覧削除処理 */
          "2103021001", "地址簿一览删除处理"
      }, {
          /** アドレス帳一覧初期表示処理 */
          "2103021002", "地址簿一览初期表示处理"
      }, {
          /** アドレス帳一覧初期表示戻る処理 */
          "2103021003", "地址簿一览初期表示返回处理"
      }, {
          /** アドレス帳一覧遷移処理 */
          "2103021004", "地址簿一览变迁处理"
      }, {
          /** アドレス帳登録戻る処理 */
          "2103022001", "地址簿登录返回处理"
      }, {
          /** アドレス帳登録確認処理 */
          "2103022002", "地址簿登录确认处理"
      }, {
          /** アドレス帳登録初期表示処理 */
          "2103022003", "地址簿登录初期表示处理"
      }, {
          /** アドレス帳登録登録処理 */
          "2103022004", "地址簿登录处理"
      }, {
          /** アドレス帳登録更新処理 */
          "2103022005", "地址簿登录更新处理"
      }, {
          /** パスワード変更初期表示処理 */
          "2103023001", "密码变更初期表示处理"
      }, {
          /** パスワード変更更新処理 */
          "2103023002", "密码变更更新处理"
      }, {
          /** ポイント利用状況出力処理 */
          "2103031001", "积分利用状况输出处理"
      }, {
          /** ポイント利用状況初期表示処理 */
          "2103031002", "积分利用状况初期表示处理"
      }, {
          /** ポイント利用状況検索処理 */
          "2103031003", "积分利用状况检索处理"
      }, {
          /** 顧客グループマスタ削除処理 */
          "2103041001", "顾客组管理删除处理"
      }, {
          /** 顧客グループマスタ初期表示処理 */
          "2103041002", "顾客组管理初期表示处理"
      }, {
          /** 顧客グループマスタ登録処理 */
          "2103041003", "顾客组管理登录处理"
      }, {
          /** 顧客グループマスタ選択処理 */
          "2103041004", "顾客组管理选择处理"
      }, {
          /** 顧客グループマスタ更新処理 */
          "2103041005", "顾客组管理更新处理"
      }, {
          /** 顧客属性マスタ削除処理 */
          "2103051001", "顾客属性管理删除处理"
      }, {
          /** 顧客属性マスタ削除属性選択処理 */
          "2103051002", "顾客属性管理删除属性选择处理"
      }, {
          /** 顧客属性マスタ初期表示処理 */
          "2103051003", "顾客属性管理初期表示处理"
      }, {
          /** 顧客属性マスタ新規処理 */
          "2103051004", "顾客属性管理新规处理"
      }, {
          /** 顧客属性マスタ登録属性処理 */
          "2103051005", "顾客属性管理登录属性处理"
      }, {
          /** 顧客属性マスタ登録属性選択処理 */
          "2103051006", "顾客属性管理登录属性选择处理"
      }, {
          /** 顧客属性マスタ選択処理 */
          "2103051007", "顾客属性管理选择处理"
      }, {
          /** 顧客属性マスタ更新属性処理 */
          "2103051008", "顾客属性管理更新属性处理"
      }, {
          /** 顧客属性マスタ更新属性選択処理 */
          "2103051009", "顾客属性管理更新属性选择处理"
      }, {
          /** 情報メール送信戻る処理 */
          "2103061001", "情报邮件送信返回处理"
      }, {
          /** 情報メール送信確認処理 */
          "2103061002", "情报邮件送信确认处理"
      }, {
          /** 情報メール送信初期表示処理 */
          "2103061003", "情报邮件送信初期表示处理"
      }, {
          /** 情報メール送信メール送信処理 */
          "2103061004", "情报邮件送信邮件送信处理"
      }, {
          /** 情報メール送信遷移処理 */
          "2103061005", "情报邮件送信变迁处理"
      }, {
          /** 情報メール送信プレビュー処理 */
          "2103061006", "情报邮件送信印刷处理"
      }, {
          /** 情報メール送信選択処理 */
          "2103061007", "情报邮件送信选择处理"
      },
  };

  private static final Object[][] CATALOG = new Object[][] {
      {
          /** 商品マスタ削除処理 */
          "3104011001", "商品管理删除处理"
      }, {
          /** 商品マスタ出力処理 */
          "3104011002", "商品管理输出处理"
      }, {
          /** 商品マスタ初期表示処理 */
          "3104011003", "商品管理初期表示处理"
      }, {
          /** 商品マスタ遷移処理 */
          "3104011004", "商品管理变迁处理"
      }, {
          /** 商品マスタ検索処理 */
          "3104011005", "商品管理检索处理"
      }, {
          /** 商品マスタ検索戻る処理 */
          "3104011006", "商品管理检索返回处理"
      }, {
          /** 商品マスタ更新処理 */
          "3104011007", "商品管理更新处理"
      }, {
          /** EC商品マスタ検索処理 */
          "3104011008", "EC商品管理检索处理"
      }, {
          /** EC商品マスタ初期表示処理 */
          "3104011009", "EC商品管理初期表示处理"
      }, {
          /** 商品登録戻る処理 */
          "3104012001", "商品登录返回处理"
      }, {
          /** 商品登録キャンセル処理 */
          "3104012002", "商品登录取消处理"
      }, {
          /** 商品登録確認処理 */
          "3104012003", "商品登录确认处理"
      }, {
          /** 商品登録初期表示処理 */
          "3104012004", "商品登录初期表示处理"
      }, {
          /** 商品登録遷移処理 */
          "3104012005", "商品登录变迁处理"
      }, {
          /** 商品登録プレビュー処理 */
          "3104012006", "商品登录印刷处理"
      }, {
          /** 商品登録登録処理 */
          "3104012007", "商品登录登录处理"
      }, {
          /** 商品登録選択処理 */
          "3104012008", "商品登录选择处理"
      }, {
          /** 商品登録更新処理 */
          "3104012009", "商品登录更新处理"
      }, {
          /** 商品登録画像削除処理 */
          "3104012010", "商品登录图像删除处理"
      }, {
          // M17N-0008 追加 ここから
          /** 商品多语言跳转处理 */
          "3104012011", "商品多语言跳转处理"
      // M17N-0008 追加 ここまで
      }, {
          /** 商品削除確認削除処理 */
          "3104013001", "商品删除确认删除处理"
      }, {
          /** 商品削除確認初期表示処理 */
          "3104013002", "商品删除确认初期表示处理"
      }, {
          /** 商品SKU削除処理 */
          "3104014001", "商品SKU删除处理"
      }, {
          /** 商品SKU初期表示処理 */
          "3104014002", "商品SKU初期表示处理"
      }, {
          /** 商品SKU遷移処理 */
          "3104014003", "商品SKU变迁处理"
      }, {
          /** 商品SKU価格更新処理 */
          "3104014004", "商品SKU价格更新处理"
      }, {
          /** 商品SKU登録処理 */
          "3104014005", "商品SKU登录处理"
      }, {
          /** 商品SKU表示処理 */
          "3104014006", "商品SKU表示处理"
      }, {
          /** 商品SKU更新処理 */
          "3104014007", "商品SKU更新处理"
      }, {
          /** 商品SKU規格名称更新処理 */
          "3104014008", "商品SKU规格名称更新处理"
      }, {
          /** 商品SKU画像削除処理 */
          "3104014009", "商品SKU图像删除处理"
      }, {
          /** 関連付け完了処理 */
          "3104016001", "关联完成处理"
      }, {
          /** 関連付け削除処理 */
          "3104016002", "关联删除处理"
      }, {
          /** 関連付け初期表示処理 */
          "3104016003", "关联初期表示处理"
      }, {
          /** 関連付け登録処理 */
          "3104016004", "关联登录处理"
      }, {
          /** 関連付け検索処理 */
          "3104016005", "关联检索处理"
      }, {
          /** 関連付け更新処理 */
          "3104016006", "关联更新处理"
      }, {
          /** 関連付け一覧初期表示処理 */
          "3104017001", "关联一览初期表示处理"
      }, {
          /** 関連付け一覧登録処理 */
          "3104017002", "关联一览登录处理"
      }, {
          // M17N-0008 追加 ここから
          /** 商品テキスト完了処理 */
          "3104018001", "商品多语言完成处理"
      }, {
          /** 商品テキスト初期表示処理 */
          "3104018002", "商品多语言初期表示处理"
      }, {
          /** 商品テキスト検索処理 */
          "3104018003", "商品多语言检索处理"
      }, {
          /** 商品テキスト更新処理 */
          "3104018004", "商品多语言更新处理"
      // M17N-0008 追加 ここまで
      // 2012/11/21 促销对应 ob add start
      }, {
          /** セット品設定初期化処理 */
          "3104019001", "套餐设定初期表示处理"
      }, {
          /** セット品明細登録処理 */
          "3104019002", "套餐明细登录处理"
      }, {
          /** セット品明細削除処理 */
          "3104019003", "套餐明细删除处理"
      // 2012/11/21 促销对应 ob add end
      }, {
          /** カテゴリマスタ削除処理 */
          "3104021001", "分类管理删除处理"
      }, {
          /** カテゴリマスタ属性削除処理 */
          "3104021002", "分类管理属性删除处理"
      }, {
          /** カテゴリマスタ初期表示処理 */
          "3104021003", "分类管理初期表示处理"
      }, {
          /** カテゴリマスタ遷移処理 */
          "3104021004", "分类管理变迁处理"
      }, {
          /** カテゴリマスタ登録処理 */
          "3104021005", "分类管理登录处理"
      }, {
          /** カテゴリマスタ選択処理 */
          "3104021006", "分类管理选择处理"
      }, {
          /** カテゴリマスタ更新処理 */
          "3104021007", "分类管理更新处理"
      }, {
          /** カテゴリ－商品関連付け削除処理 */
          "3104022001", "分类－商品关联删除处理"
      }, {
          /** カテゴリ－商品関連付け初期表示処理 */
          "3104022002", "分类－商品关联初期表示处理"
      }, {
          /** カテゴリ－商品関連付け登録処理 */
          "3104022003", "分类－商品关联登录处理"
      }, {
          /** カテゴリ－商品関連付け検索処理 */
          "3104022004", "分类－商品关联检索处理"
      }, {
          /** カテゴリ－商品関連付け選択処理 */
          "3104022005", "分类－商品关联选择处理"
      }, {
          /** カテゴリ－商品関連付け更新処理 */
          "3104022006", "分类－商品关联更新处理"
      }, {
          /** カテゴリツリー関連付け初期表示処理 */
          "3104023001", "分类树关联初期表示处理"
      }, {
          /** カテゴリツリー関連付け登録処理 */
          "3104023002", "分类树关联登录处理"
      }, {
          /** ギフトマスタ削除処理 */
          "3104031001", "礼物管理删除处理"
      }, {
          /** ギフトマスタ初期表示処理 */
          "3104031002", "礼物管理初期表示处理"
      }, {
          /** ギフトマスタ遷移処理 */
          "3104031003", "礼物管理变迁处理"
      }, {
          /** ギフトマスタ登録処理 */
          "3104031004", "礼物管理登录处理"
      }, {
          /** ギフトマスタ検索処理 */
          "3104031005", "礼物管理检索处理"
      }, {
          /** ギフトマスタ選択処理 */
          "3104031006", "礼物管理选择处理"
      }, {
          /** ギフトマスタ更新処理 */
          "3104031007", "礼物管理更新处理"
      }, {
          /** タグマスタ完了処理 */
          "3104041001", "标签管理完成处理"
      }, {
          /** タグマスタ削除処理 */
          "3104041002", "标签管理删除处理"
      }, {
          /** タグマスタ初期表示処理 */
          "3104041003", "标签管理初期表示处理"
      }, {
          /** タグマスタ遷移処理 */
          "3104041004", "标签管理变迁处理"
      }, {
          /** タグマスタ登録処理 */
          "3104041005", "标签管理登录处理"
      }, {
          /** タグマスタ検索処理 */
          "3104041006", "标签管理检索处理"
      }, {
          /** タグマスタ検索戻る処理 */
          "3104041007", "标签管理检索返回处理"
      }, {
          /** タグマスタ選択処理 */
          "3104041008", "标签管理选择处理"
      }, {
          /** タグマスタ更新処理 */
          "3104041009", "标签管理更新处理"
      }, {
          /** 入出庫管理完了処理 */
          "3104051001", "出入库管理完成处理"
      }, {
          /** 入出庫管理初期表示処理 */
          "3104051002", "出入库管理初期表示处理"
      }, {
          /** 入出庫管理登録処理 */
          "3104051003", "出入库管理登录处理"
      }, {
          /** 入出庫管理検索処理 */
          "3104051004", "出入库管理检索处理"
      }, {
          /** 在庫状況設定削除処理 */
          "3104061001", "库存状况设定删除处理"
      }, {
          /** 在庫状況設定初期表示処理 */
          "3104061002", "库存状况设定初期表示处理"
      }, {
          /** 在庫状況設定登録処理 */
          "3104061003", "库存状况设定登录处理"
      }, {
          /** 在庫状況設定検索処理 */
          "3104061004", "库存状况设定检索处理"
      }, {
          /** 在庫状況設定選択処理 */
          "3104061005", "库存状况设定选择处理"
      }, {
          /** 在庫状況設定更新処理 */
          "3104061006", "库存状况设定更新处理"
      }, {
          /** 入荷お知らせ削除処理 */
          "3104071001", "到货通知删除处理"
      }, {
          /** 入荷お知らせ出力処理 */
          "3104071002", "到货通知输出处理"
      },
      /*
       * {
       *//** 入荷お知らせ初期表示処理 */
      /*
       * "3104071003", "到货通知初期表示处理" },
       */
      {
          /** 入荷お知らせ検索処理 */
          "3104071004", "到货通知检索处理"
      }, {
          /** 商品詳細レイアウト完了処理 */
          "3104081001", "商品详细布局完成处理"
      }, {
          /** 商品詳細レイアウト初期表示処理 */
          "3104081002", "商品详细布局初期表示处理"
      }, {
          /** 商品詳細レイアウト登録処理 */
          "3104081003", "商品详细布局登录处理"
      }, {
          /** 商品詳細レイアウトリセット処理 */
          "3104081004", "商品详细布局重置处理"
      }, {
          /** 商品詳細レイアウト検索処理 */
          "3104081005", "商品详细布局检索处理"
      },
      // add by os012 20111219 start
      {
          /** 品牌管理完了処理 */
          "3104091001", "品牌管理完成处理"
      }, {
          /** 品牌管理削除処理 */
          "3104091002", "品牌管理删除处理"
      }, {
          /** 品牌管理初期表示処理 */
          "3104091003", "品牌管理初期表示处理"
      }, {
          /** 品牌管理遷移処理 */
          "3104091004", "品牌管理变迁处理"
      }, {
          /** 品牌管理登録処理 */
          "3104091005", "品牌管理登录处理"
      }, {
          /** 品牌管理検索処理 */
          "3104091006", "品牌管理检索处理"
      }, {
          /** 品牌管理検索戻る処理 */
          "3104091007", "品牌管理检索返回处理"
      }, {
          /** 品牌管理選択処理 */
          "3104091008", "品牌管理选择处理"
      }, {
          /** 品牌管理更新処理 */
          "3104091009", "品牌管理更新处理"
      }, {
          /** 商品图片管理初期表示処理 */
          "3104100001", "商品图片管理初期表示处理"
      }, {
          /** 商品图片管理検索処理 */
          "3104100002", "商品图片管理检索处理"
      }, {
          /** 库存管理初期表示処理 */
          "3180000303", "库存管理初期表示处理"
      }, {
          /** 库存管理検索処理 */
          "3180000304", "库存管理检索处理"
      }, {
          /** 库存管理登録処理 */
          "3180000305", "库存管理登录处理"
      }, {
          /** 商品CSV导入初期表示処理 */
          "3180004001", "商品CSV导入初期表示处理"
      }, {
          /** 商品CSV导出初期表示処理 */
          "3180004002", "商品CSV导出初期表示处理"
      }, {
          /** 商品CSV导出处理 */
          "3180004003", "商品CSV导出处理"
      }, {
          /** 下载淘宝商品类目表 */
          "3180004004", "下载淘宝商品类目表"
      }, {
          /** 下载淘宝商品品牌表 */
          "3180004005", "下载淘宝商品品牌表"
      }, {
          /** 下载官网商品分类表 */
          "3180004006", "下载官网商品分类表"
      }, {
          /** 下载官网品牌表 */
          "3180004007", "下载官网品牌表"
      }, {
        // 2014/05/07 京东WBS对应 ob_卢 add start
         /** 下载京东商品类目表 */
          "3180004008", "下载京东商品类目表"
      }, {
         /** 下载京东商品品牌表 */
          "3180004009", "下载京东商品品牌表"
      }, {
        // 2014/05/07 京东WBS对应 ob_卢 add end
          /** 商品同期化初期表示処理 */
          "3200004001", "商品同期化初期表示处理"
      }, {
          /** 商品同期化EC待同期商品检索 */
          "3200004002", "商品同期化EC待同期商品检索"
      }, {
          /** 商品同期化TMALL待同期商品检索 */
          "3200004003", "商品同期化TMALL待同期商品检索"
      }, {
          /** 商品同期化処理 */
          "3200004004", "商品同期化处理"
      }, {
          /** 同期化履历初期表示処理 */
          "3200004005", "同期化履历初期表示处理"
      }, {
          /** 同期化履历检索 */
          "3200004006", "同期化履历检索"
      }, {
          /** 品牌管理初期表示処理 */
          "0320100104", "品牌管理初期表示处理"
      }, {
          /** 品牌管理登录处理 */
          "0320100105", "品牌管理登录处理"
      }, {
          /** 品牌管理确认登录处理 */
          "0320100106", "品牌管理确认登录处理"
      }, {
          /** TMALL商品管理初期表示处理 */
          "3104013003", "TMALL商品管理初期表示处理"
      },
  // add by os012 20111219 end
      {
        /** 组合商品登录 */
        "3104015001", "组合商品登录"
      }, {
      /** 组合商品登录 */
      "3104015002", "组合商品查询"
      }, {
        /** 组合商品登录 */
        "3104015003", "组合商品删除"
      }, {
        /** 组合商品登录 */
        "3104015004", "组合商品新建登录"
      }, {
        /** TMALL库存分配初期显示处理 */
        "3104015005", "TMALL库存分配初期显示处理"
      }, {
        /** TMALL库存分配更新处理 */
        "3104015006", "TMALL库存分配更新处理"
      
      // 2014/06/17 库存更新对应 ob_卢 add start
      }, {
        /** 京东库存分配初期显示处理 */
        "3104015007", "京东库存分配初期显示处理"
      }, {
        /** 京东库存分配更新处理 */
        "3104015008", "京东库存分配更新处理"
      // 2014/06/17 库存更新对应 ob_卢 add end
      },
  };

  private static final Object[][] SHOP = new Object[][] {
      {
          /** サイト設定戻る処理 */
          "4105011001", "网站设定返回处理"
      }, {
          /** サイト設定確認処理 */
          "4105011002", "网站设定确认处理"
      }, {
          /** サイト設定初期表示処理 */
          "4105011003", "网站设定初期表示处理"
      }, {
          /** サイト設定登録処理 */
          "4105011004", "网站设定登录处理"
      }, {
          /** ショップマスタ編集処理 */
          "4105021001", "店铺管理编集处理"
      }, {
          /** ショップマスタ初期表示処理 */
          "4105021002", "店铺管理初期表示处理"
      }, {
          /** ショップマスタ検索処理 */
          "4105021003", "店铺管理检索处理"
      }, {
          /** ショップマスタ検索戻る処理 */
          "4105021004", "店铺管理检索返回处理"
      }, {
          /** ショップ登録戻る処理 */
          "4105022001", "店铺登录返回处理"
      }, {
          /** ショップ登録確認処理 */
          "4105022002", "店铺登录确认处理"
      }, {
          /** ショップ登録削除処理 */
          "4105022003", "店铺登录删除处理"
      }, {
          /** ショップ登録初期表示処理 */
          "4105022004", "店铺登录初期表示处理"
      }, {
          /** ショップ登録登録処理 */
          "4105022005", "店铺登录登录处理"
      }, {
          /** ショップ登録遷移処理 */
          "4105022006", "店铺登录变迁处理"
      }, {
          /** ショップ登録更新処理 */
          "4105022007", "店铺登录更新处理"
      }, {
          /** ショップマスタ削除確認キャンセル処理 */
          "4105024001", "店铺管理删除确认取消处理"
      }, {
          /** ショップマスタ削除確認削除処理 */
          "4105024002", "店铺管理删除确认删除处理"
      }, {
          /** ショップマスタ削除確認初期表示処理 */
          "4105024003", "店铺管理删除确认初期表示处理"
      }, {
          /** ポイントルール初期表示処理 */
          "4105031001", "积分规则初期表示处理"
      }, {
          /** ポイントルール登録処理 */
          "4105031002", "积分规则登录处理"
      }, {
          /** 消費税マスタ削除処理 */
          "4105041001", "消费税管理删除处理"
      }, {
          /** 消費税マスタ初期表示処理 */
          "4105041002", "消费税管理初期表示处理"
      }, {
          /** 消費税マスタ登録処理 */
          "4105041003", "消费税管理登录处理"
      }, {
          /** 支払方法設定手数料削除処理 */
          "4105051001", "支付方法设定手续费删除处理"
      }, {
          /** 支払方法設定支払方法削除処理 */
          "4105051002", "支付方法设定支付方法删除处理"
      }, {
          /** 支払方法設定初期表示処理 */
          "4105051003", "支付方法设定初期表示处理"
      }, {
          /** 支払方法設定遷移編集処理 */
          "4105051004", "支付方法设定变迁编集处理"
      }, {
          /** 支払方法設定支払情報処理 */
          "4105051005", "支付方法设定支付情报处理"
      }, {
          /** 支払方法設定登録支払手数料処理 */
          "4105051006", "支付方法设定登录支付手续费处理"
      }, {
          /** 支払方法設定更新支払手数料処理 */
          "4105051007", "支付方法设定更新支付手续费处理"
      }, {
          /** 支払方法詳細初期表示処理 */
          "4105052001", "支付方法详细初期表示处理"
      }, {
          /** 支払方法詳細金融機関設定遷移処理 */
          "4105052002", "支付方法详细金融机关设定变迁处理"
      }, {
          /** 支払方法詳細登録処理 */
          "4105052003", "支付方法详细登录处理"
      }, {
          /** 金融機関設定削除処理 */
          "4105053001", "金融机关设定删除处理"
      }, {
          /** 金融機関設定初期表示処理 */
          "4105053002", "金融机关设定初期表示处理"
      }, {
          /** 金融機関設定登録処理 */
          "4105053003", "金融机关设定登录处理"
      }, {
          /** 金融機関設定選択処理 */
          "4105053004", "金融机关设定选择处理"
      }, {
          /** 配送・送料設定配送種別削除処理 */
          "4105061001", "发送·运费设定发送种别删除处理"
      }, {
          /** 配送・送料設定配送指定時間削除処理 */
          "4105061002", "发送·运费设定发送指定时间删除处理"
      }, {
          /** 配送・送料設定初期表示処理 */
          "4105061003", "发送·运费设定初期表示处理"
      }, {
          /** 配送・送料設定配送指定時間登録処理 */
          "4105061004", "发送·运费设定发送指定时间登录处理"
      }, {
          /** 配送・送料設定遷移処理 */
          "4105061005", "发送·运费设定变迁处理"
      }, {
          /** 配送・送料設定配送指定時間表示処理 */
          "4105061006", "发送·运费设定发送指定时间表是处理"
      }, {
          /** 配送・送料設定配送指定時間更新処理 */
          "4105061007", "发送·运费设定发送指定时间更新处理"
      }, {
          /** 配送種別設定明細削除処理 */
          "4105062001", "发送种别设定明细删除处理"
      }, {
          /** 配送種別設定明細初期表示処理 */
          "4105062002", "发送种别设定明细初期表示处理"
      }, {
          /** 配送種別設定明細登録処理 */
          "4105062003", "发送种别设定明细登录处理"
      }, {
          /** 配送種別設定明細更新処理 */
          "4105062004", "发送种别设定明细更新处理"
      }, {
          /** カレンダーマスタ初期表示処理 */
          "4105071001", "日历管理初期表示处理"
      }, {
          /** カレンダーマスタ登録処理 */
          "4105071002", "日历管理登录处理"
      }, {
          /** 地域ブロック設定削除処理 */
          "4105081001", "地域块设定删除处理"
      }, {
          /** 地域ブロック設定初期表示処理 */
          "4105081002", "地域块设定初期表示处理"
      }, {
          /** 地域ブロック設定登録処理 */
          "4105081003", "地域块设定登录处理"
      }, {
          /** 地域ブロック設定登録都道府県処理 */
          "4105081004", "地域ブロック設定登录都道府县处理"
      }, {
          /** 地域ブロック設定更新処理 */
          "4105081005", "地域ブロック設定更新处理"
      }, {
          /** 管理ユーザマスタ削除処理 */
          "4105091001", "管理用户管理删除处理"
      }, {
          /** 管理ユーザマスタ初期表示処理 */
          "4105091002", "管理用户管理初期表示处理"
      }, {
          /** 管理ユーザマスタ遷移処理 */
          "4105091003", "管理用户管理变迁处理"
      }, {
          /** 管理ユーザマスタ検索処理 */
          "4105091004", "管理用户管理检索处理"
      }, {
          /** 管理ユーザマスタ明細戻る処理 */
          "4105092001", "管理用户管理明细返回处理"
      }, {
          /** 管理ユーザマスタ明細確認処理 */
          "4105092002", "管理用户管理明细确认处理"
      }, {
          /** 管理ユーザマスタ明細初期表示処理 */
          "4105092003", "管理用户管理明细初期表示处理"
      }, {
          /** 管理ユーザマスタ明細登録処理 */
          "4105092004", "管理用户管理明细登录处理"
      }, {
          /** 管理ユーザマスタ明細更新処理 */
          "4105092005", "管理用户管理明细更新处理"
      }, {
          /** 管理側アクセスログ初期表示処理 */
          "4105094001", "管理方面访问日志初期表示处理"
      }, {
          /** 管理側アクセスログ検索処理 */
          "4105094002", "管理方面访问日志检索处理"
      }, {
          /** メールテンプレート情報メール削除処理 */
          "4105111001", "邮件模板情报邮件删除处理"
      }, {
          /** メールテンプレート初期表示処理 */
          "4105111002", "邮件模板初期表示处理"
      }, {
          /** メールテンプレート情報メール登録処理 */
          "4105111003", "邮件模板情报邮件登录处理"
      }, {
          /** メールテンプレートプレビュー処理 */
          "4105111004", "邮件模板印刷处理"
      }, {
          /** メールテンプレート登録処理 */
          "4105111005", "邮件模板登录处理"
      }, {
          /** メールテンプレート登録プレビュー処理 */
          "4105111006", "邮件模板登录印刷处理"
      }, {
          /** メールテンプレートメールタイプ選択処理 */
          "4105111007", "邮件模板邮件类型选择处理"
      }, {
          /** お知らせ編集削除処理 */
          "4105121001", "通知编集删除处理"
      }, {
          /** お知らせ編集初期表示処理 */
          "4105121002", "通知编集初期表示处理"
      }, {
          /** お知らせ編集登録処理 */
          "4105121003", "通知编集登录处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105121004", "通知编集选择处理"
      },
      // soukai add 2011/12/21 ob start
      {
          /** お知らせ編集選択処理 */
          "4105131001", "运费设定初期表示处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105131002", "运费设定明细选择处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105131003", "运费设定更新处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105141001", "配送公司一览初期表示处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105141002", "配送公司一览选择处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105141003", "配送公司一览默认配送公司设定处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105151001", "配送公司详细初期表示处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105151002", "配送公司详细删除处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105151003", "配送公司详细地域详细设定跳转"
      }, {
          /** お知らせ編集選択処理 */
          "4105151004", "配送公司详细画面追加处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105151005", "配送公司详细画面更新处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105161001", "配送希望日时关联情报初期表示处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105161002", "配送希望日时关联情报追加处理"
      }, {
          /** お知らせ編集選択処理 */
          "4105161003", "配送希望日时关联情报删除处理"
      },
  // soukai add 2011/12/21 ob end
  };

  private static final Object[][] COMMUNICATION = new Object[][] {
      {
          /** アンケート管理削除処理 */
          "5106011001", "咨询调查管理删除处理"
      }, {
          /** アンケート管理初期表示処理 */
          "5106011002", "咨询调查管理初期表示处理"
      }, {
          /** アンケート管理遷移処理 */
          "5106011003", "咨询调查管理变迁处理"
      }, {
          /** アンケート管理検索処理 */
          "5106011004", "咨询调查管理检索处理"
      }, {
          /** アンケート管理検索戻る処理 */
          "5106011005", "咨询调查管理检索返回处理"
      }, {
          /** アンケートマスタ変更設問処理 */
          "5106012001", "咨询调查管理变更设问处理"
      }, {
          /** アンケートマスタ削除選択処理 */
          "5106012002", "咨询调查管理删除选择处理"
      }, {
          /** アンケートマスタ削除設問処理 */
          "5106012003", "咨询调查管理删除设问处理"
      }, {
          /** アンケートマスタ明細処理 */
          "5106012004", "咨询调查管理明细处理"
      }, {
          /** アンケートマスタ初期表示処理 */
          "5106012005", "咨询调查管理初期表示处理"
      }, {
          /** アンケートマスタ新規選択処理 */
          "5106012006", "咨询调查管理新规选择处理"
      }, {
          /** アンケートマスタ登録基礎処理 */
          "5106012007", "咨询调查管理登录基础处理"
      }, {
          /** アンケートマスタ登録選択処理 */
          "5106012008", "咨询调查管理登录选择处理"
      }, {
          /** アンケートマスタ登録設問処理 */
          "5106012009", "咨询调查管理登录设问处理"
      }, {
          /** アンケートマスタ選択選択処理 */
          "5106012010", "咨询调查管理选择选择处理"
      }, {
          /** アンケートマスタ選択設問処理 */
          "5106012011", "咨询调查管理选择设问处理"
      }, {
          /** アンケートマスタ更新基礎処理 */
          "5106012012", "咨询调查管理更新基础处理"
      }, {
          /** アンケートマスタ更新選択処理 */
          "5106012013", "咨询调查管理更新选择处理"
      }, {
          /** アンケートマスタ更新設問処理 */
          "5106012014", "咨询调查管理更新设问处理"
      }, {
          /** アンケート分析出力処理 */
          "5106013001", "咨询调查分析输出处理"
      }, {
          /** アンケート分析初期表示処理 */
          "5106013002", "咨询调查分析初期表示处理"
      }, {
          /** レビュー管理削除処理 */
          "5106021001", "评论管理删除处理"
      }, {
          /** レビュー管理初期表示処理 */
          "5106021002", "评论管理初期表示处理"
      }, {
          /** レビュー管理遷移処理 */
          "5106021003", "评论管理变迁处理"
      }, {
          /** レビュー管理検索処理 */
          "5106021004", "评论管理检索处理"
      }, {
          /** レビュー管理検索戻る処理 */
          "5106021005", "评论管理检索返回处理"
      }, {
          /** レビュー管理更新処理 */
          "5106021006", "评论管理更新处理"
      }, {
          /** キャンペーン管理削除処理 */
          "5106031001", "活动管理删除处理"
      }, {
          /** キャンペーン管理初期表示処理 */
          "5106031002", "活动管理初期表示处理"
      }, {
          /** キャンペーン管理遷移処理 */
          "5106031003", "活动管理变迁处理"
      }, {
          /** キャンペーン管理検索処理 */
          "5106031004", "活动管理检索处理"
      }, {
          /** キャンペーン管理検索戻る処理 */
          "5106031005", "活动管理检索返回处理"
      }, {
          /** キャンペーンマスタ初期表示処理 */
          "5106032001", "活动管理初期表示处理"
      }, {
          /** キャンペーンマスタ遷移処理 */
          "5106032002", "活动管理变迁处理"
      }, {
          /** キャンペーンマスタ登録処理 */
          "5106032003", "活动管理登录处理"
      }, {
          /** キャンペーン分析出力処理 */
          "5106034001", "活动分析输出处理"
      }, {
          /** キャンペーン分析初期表示処理 */
          "5106034002", "活动分析初期表示处理"
      }, {
          /** メールマガジンマスタ削除処理 */
          "5106041001", "邮件杂志管理删除处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106041002", "邮件杂志管理输出处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106041003", "邮件杂志管理初期表示处理"
      }, {
          /** メールマガジンマスタ登録処理 */
          "5106041004", "邮件杂志管理登录处理"
      }, {
          /** メールマガジンマスタ選択処理 */
          "5106041005", "邮件杂志管理选择处理"
      }, {
          /** メールマガジンマスタ更新処理 */
          "5106041006", "邮件杂志管理更新处理"
      }, {
          /** メールマガジンマスタ削除処理 */
          "5106051001", "顾客组别优惠规则管理初期表示处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106051002", "顾客组别优惠规则管理变迁处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106051003", "顾客组别优惠规则管理检索处理"
      }, {
          /** メールマガジンマスタ登録処理 */
          "5106051004", "顾客组别优惠规则管理删除处理"
      }, {
          /** メールマガジンマスタ選択処理 */
          "5106051005", "顾客组别优惠规则管理返回处理"
      }, {
          /** メールマガジンマスタ更新処理 */
          "5106052001", "顾客组别优惠登录画面初期表示处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106052002", "顾客组别优惠更新处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106052003", "顾客组别优惠登录处理"
      }, {
          /** メールマガジンマスタ削除処理 */
          "5106061001", "顾客别优惠券发行规则一览处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106061002", "顾客别优惠券发行规则删除处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106061003", "顾客别优惠券发行规详细信息跳转处理"
      }, {
          /** メールマガジンマスタ登録処理 */
          "5106061004", "顾客别优惠券发行规则检索处理"
      }, {
          /** メールマガジンマスタ選択処理 */
          "5106061005", "返回顾客别优惠券发行规则检索返回处理"
      }, {
          /** メールマガジンマスタ更新処理 */
          "5106062001", "顾客组别优惠券发行规则详细信息一览处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106062002", "顾客组别优惠券发行规则详细信息更新处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106062003", "顾客组别优惠券发行规则详细信息新建登录处理"
      }, {
          /** メールマガジンマスタ削除処理 */
          "5106071001", "公共优惠券发行规则一览画面初期表示处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106071002", "公共优惠券发行规则详细信息画面跳转处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106071003", "公共优惠券发行规则一览画面检索处理"
      }, {
          /** メールマガジンマスタ登録処理 */
          "5106071004", "公共优惠券发行规则一览画面检索返回处理"
      }, {
          /** メールマガジンマスタ選択処理 */
          "5106071005", "公共优惠券发行规则一览画面删除处理"
      }, {
          /** メールマガジンマスタ更新処理 */
          "5106072001", "公共优惠券发行规则详细画面初期表示处理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106072002", "公共优惠券发行规则详细画面新建登录处理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106072003", "公共优惠券发行规则详细画面更新处理"
      }, {
          // 2012/11/21 促销对应 ob add start
          /** キャンペーン管理初期表示処理 */
          "5106101001", "促销活动一览画面初期表示处理"
      }, {
          /** キャンペーン管理遷移処理 */
          "5106101002", "促销活动一览画面跳转处理"
      }, {
          /** キャンペーン管理検索処理 */
          "5106101003", "促销活动一览画面检索处理"
      }, {
          /** キャンペーン管理検索戻る処理 */
          "5106101004", "促销活动一览画面检索返回处理"
      }, {
          /** キャンペーン管理削除処理 */
          "5106101005", "促销活动一览画面删除处理"
      }, {
          /** キャンペーンマスタ初期表示処理 */
          "5106102001", "促销活动编辑画面初期表示处理"
      }, {
          /** キャンペーンマスタ登録処理 */
          "5106102002", "促销活动编辑画面新建登录处理"
      }, {
          /** キャンペーンマスタ更新処理 */
          "5106102003", "促销活动编辑画面更新处理"
      }, {
          /** キャンペーンマスタ条件設定処理 */
          "5106102004", "促销活动编辑画面促销条件设定处理"
      }, {
          /** キャンペーンマスタ行為設定処理 */
          "5106102005", "促销活动编辑画面促销行为设定处理"
      }, {
          /** キャンペーンマスタ行為設定処理 */
          "5106102006", "促销活动编辑画面选择处理"
      // 2012/11/21 促销对应 ob add end
      }, {
          "5106111001", "朋友推荐优惠券初期表示处理"
      }, {
          "5106111002", "朋友推荐优惠券删除处理"
      }, {
          "5106111003", "朋友推荐优惠券查询处理"
      }, {
          "5106111004", "朋友推荐优惠券修改处理"
      }, {
          "5106111005", "朋友推荐优惠券增加处理"
      }, {
        // 20130729 txw add start
        /** 限时限量折扣一览初期表示处理 */
        "5106121001", "限时限量折扣一览初期表示处理"
      }, {
        /** 限时限量折扣一览画面跳转处理 */
        "5106121002", "限时限量折扣一览画面跳转处理"
      }, {
        /** 限时限量折扣一览画面检索处理 */
        "5106121003", "限时限量折扣一览画面检索处理"
      }, {
        /** 限时限量折扣一览画面返回处理 */
        "5106121004", "限时限量折扣一览画面返回处理"
      }, {
        /** 限时限量折扣一览画面删除处理 */
        "5106121005", "限时限量折扣一览画面删除处理"
      }, {
        /** 促销活动编辑画面初期表示处理 */
        "5106122001", "限时限量折扣编辑画面初期表示处理"
      }, {
        /** 促销活动编辑画面登录表示处理 */
        "5106122002", "限时限量折扣编辑画面登录表示处理"
      }, {
        /** 限时限量折扣编辑画面更新表示处理 */
        "5106122003", "限时限量折扣编辑画面更新表示处理"
      }, {
        /** 限时限量折扣编辑画面商品登录表示处理 */
        "5106122004", "限时限量折扣编辑画面商品登录表示处理"
      }, {
        /** 限时限量折扣编辑画面商品更新表示处理 */
        "5106122005", "限时限量折扣编辑画面商品更新表示处理"
      }, {
        /** 限时限量折扣编辑画面商品删除表示处理 */
        "5106122006", "限时限量折扣编辑画面商品删除表示处理"
      }, {
        /** 限时限量折扣编辑画面选择表示处理 */
        "5106122007", "限时限量折扣编辑画面选择表示处理"
      }
      // 20130729 txw add end
      // 20131011 txw add start
      ,{
        /** 免邮促销一览初期表示处理 */
        "5106131001", "免邮促销一览初期表示处理"
      }, {
        /** 免邮促销一览初期表示处理 */
        "5106131002", "免邮促销一览检索表示处理"
      }, {
        /** 免邮促销一览初期表示处理 */
        "5106131003", "免邮促销一览删除表示处理"
      }, {
        /** 免邮促销一览迁移处理 */
        "5106131004", "免邮促销一览迁移处理"
      }, {
        /** 免邮促销一览迁移返回处理 */
        "5106131005", "免邮促销一览迁移返回处理"
      }, {
        /** 免邮促销初始表示处理 */
        "5106131006", "免邮促销初始表示处理"
      }, {
        /** 免邮促销新建登录处理 */
        "5106131007", "免邮促销新建登录处理"
      }, {
        /** 邮促销选择表示处理 */
        "5106131008", "邮促销选择表示处理"
      }, {
        /** 免邮促销更新处理 */
        "5106131009", "免邮促销更新处理"
      }, {
        /** 免邮促销关联商品登录处理 */
        "5106131010", "免邮促销关联商品登录处理"
      }, {
        /** 免邮促销关联品牌登录处理 */
        "5106131011", "免邮促销关联品牌登录处理"
      }, {
        /** 免邮促销关联分类登录处理 */
        "5106131012", "免邮促销关联分类登录处理"
      }, {
        /** 免邮促销关联发布代码登录处理 */
        "5106131013", "免邮促销关联免邮代码发布登录处理"
      }, {
        /** 免邮促销关联内容删除处理 */
        "5106131014", "免邮促销关联内容删除处理"
      }
      // 20131011 txw add end
      //20131112 wz add start
      ,{
        /** 礼品卡取消标志处理 */
        "5106141001","礼品卡取消标志处理"
      },{
        /** 礼品卡CSV导出处理 */
        "5106141002","礼品卡CSV导出处理"
      },{
        /** 礼品卡初期显示处理 */
        "5106141003","礼品卡初期显示处理"
      },{
        /** 礼品卡发行处理 */
        "5106141004","礼品卡发行处理"
      },{
        /** 礼品卡登陆处理 */
        "5106141005","礼品卡登陆处理"
      },{
        /** 礼品卡单条取消发行处理 */
        "5106141006","礼品卡单条取消发行处理"
      },{
        /** 礼品卡信息更新处理 */
        "5106141007","礼品卡信息更新处理"
      },{
        /** 礼品卡管理初期显示处理 */
        "5106141008","礼品卡管理初期显示处理"
      },{
        /** 礼品卡取消标志处理 */
        "5106141009","礼品卡取消标志处理"
      },{
        /** 礼品卡信息检索处理 */
        "5106141010","礼品卡信息检索处理"
      },{
        /** 礼品卡一览画面检索返回处理 */
        "5106141011","礼品卡一览画面检索返回处理"
      }
      //20131112 wz add end
      // 20140303 txw add start
      ,{
        /** 宣传品活动一览初期表示处理 */
        "5106151001","宣传品活动一览初期表示处理"
      },{
        /** 宣传品活动一览检索表示处理 */
        "5106151002","宣传品活动一览检索表示处理"
      },{
        /** 宣传品活动一览删除表示处理 */
        "5106151003","宣传品活动一览删除表示处理"
      },{
        /** 宣传品活动一览迁移处理 */
        "5106151004","宣传品活动一览迁移处理"
      },{
        /** 宣传品活动一览迁移返回处理 */
        "5106151005","宣传品活动一览迁移返回处理"
      },{
        /** 宣传品活动初始表示处理 */
        "5106152001","宣传品活动初始表示处理"
      },{
        /** 宣传品活动新建登录处理 */
        "5106152002","宣传品活动新建登录处理"
      },{
        /** 宣传品活动选择表示处理 */
        "5106152003","宣传品活动选择表示处理"
      },{
        /** 宣传品活动更新处理 */
        "5106152004","宣传品活动更新处理"
      },{
        /** 宣传品活动附送商品登录处理 */
        "5106152005","宣传品活动附送商品登录处理"
      },{
        /** 宣传品活动附送商品删除处理 */
        "5106152006","宣传品活动附送商品删除处理"
      }
      // 20140303 txw add end
  };

  private static final Object[][] ANALYSIS = new Object[][] {
      {
          /** アクセスログ集計出力処理 */
          "6107011003", "访问日志集计数出处理"
      }, {
          /** アクセスログ集計初期表示処理 */
          "6107011004", "访问日志集计初期表示处理"
      }, {
          /** アクセスログ集計遷移処理 */
          "6107011005", "访问日志集计变迁处理"
      }, {
          /** アクセスログ集計検索処理 */
          "6107011006", "访问日志集计检索处理"
      }, {
          /** リファラー集計出力処理 */
          "6107013001", "参照集计数出处理"
      }, {
          /** リファラー集計初期表示処理 */
          "6107013002", "参照集计初期表示处理"
      }, {
          /** リファラー集計検索処理 */
          "6107013003", "参照集计检索处理"
      }, {
          /** 商品別アクセスログ集計出力処理 */
          "6107021001", "按商品访问日志集计输出处理"
      }, {
          /** 商品別アクセスログ集計初期表示処理 */
          "6107021002", "按商品访问日志集计初期表示处理"
      }, {
          /** 商品別アクセスログ集計検索処理 */
          "6107021003", "按商品访问日志集计检索处理"
      }, {
          /** 顧客嗜好分析出力処理 */
          "6107031001", "顾客嗜好分析输出处理"
      }, {
          /** 顧客嗜好分析初期表示処理 */
          "6107031002", "顾客嗜好分析初期表示处理"
      }, {
          /** 顧客嗜好分析検索処理 */
          "6107031003", "顾客嗜好分析检索处理"
      }, {
          /** 顧客嗜好分析選択処理 */
          "6107031004", "顾客嗜好分析选择处理"
      }, {
          /** 顧客分析初期表示処理 */
          "6107051001", "顾客分析初期表示处理"
      }, {
          /** RFM分析出力処理 */
          "6107071001", "RFM分析输出处理"
      }, {
          /** RFM分析初期表示処理 */
          "6107071002", "RFM分析初期表示处理"
      }, {
          /** RFM分析検索処理 */
          "6107071003", "RFM分析检索处理"
      }, {
          /** ショップ別売上集計出力処理 */
          "6107081001", "按店铺销售额集计数出处理"
      }, {
          /** ショップ別売上集計初期表示処理 */
          "6107081002", "按店铺销售额集计初期表示处理"
      }, {
          /** ショップ別売上集計遷移処理 */
          "6107081003", "按店铺销售额集计变迁处理"
      }, {
          /** ショップ別売上集計検索処理 */
          "6107081004", "按店铺销售额集计检索处理"
      }, {
          /** ショップ別売上集計検索戻る処理 */
          "6107081005", "按店铺销售额集计检索返回处理"
      }, {
          /** 売上集計出力処理 */
          "6107082001", "销售额集计输出处理"
      }, {
          /** 売上集計初期表示処理 */
          "6107082002", "销售额集计初期表示处理"
      }, {
          /** 売上集計検索処理 */
          "6107082003", "销售额集计检索处理"
      }, {
          /** 商品別売上集計出力処理 */
          "6107083001", "按商品销售额集计输出处理"
      }, {
          /** 商品別売上集計初期表示処理 */
          "6107083002", "按商品销售额集计初期表示处理"
      }, {
          /** 商品別売上集計検索処理 */
          "6107083003", "按商品销售额集计检索处理"
      }, {
          /** 検索キーワード集計出力処理 */
          "6107091001", "检索关键字集计数出处理"
      }, {
          /** 検索キーワード集計初期表示処理 */
          "6107091002", "检索关键字集计初期表示处理"
      }, {
          /** 検索キーワード集計検索処理 */
          "6107091003", "检索关键字集计检索处理"
      }, {
          /** 検索キーワード集計出力処理 */
          "6107101001", "顾客组别优惠分析一览画面初期化处理"
      }, {
          /** 検索キーワード集計初期表示処理 */
          "6107101002", "顾客组别优惠分析一览画面检索处理"
      }, {
          /** 検索キーワード集計出力処理 */
          "6107111001", "顾客别优惠券发行分析一览画面初期化处理"
      }, {
          /** 検索キーワード集計初期表示処理 */
          "6107111002", "顾客别优惠券发行分析一览画面检索处理"
      }, {
          /** 検索キーワード集計出力処理 */
          "6107141001", "公共优惠券发行规则一览画面初期化处理"
      }, {
          /** 検索キーワード集計初期表示処理 */
          "6107141002", "公共优惠券发行规则一览画面检索处理"
      }
  };

  private static final Object[][] DATA_IO = new Object[][] {
      {
          /** データ一括出力出力処理 */
          "7108011001", "数据一起输出输出处理"
      }, {
          /** データ一括出力初期表示処理 */
          "7108011002", "数据一起输出初期表示处理"
      }, {
          /** データ一括取込完了処理 */
          "7108021001", "数据一起取入完成处理"
      }, {
          /** データ一括取込初期表示処理 */
          "7108021002", "数据一起取入初期表示处理"
      }, {
          /** ファイルアップロード完了処理 */
          "7108031001", "文件上传完了处理"
      }, {
          /** ファイルアップロード初期表示処理 */
          "7108031002", "文件上传初期表示处理"
      }, {
          /** ファイルアップロード検索処理 */
          "7108031003", "文件上传检索处理"
      }, {
          /** ファイル削除削除処理 */
          "7108041001", "文件删除处理"
      }, {
          /** ファイル削除初期表示処理 */
          "7108041002", "文件删除初期表示处理"
      }, {
          /** ファイル削除検索処理 */
          "7108041003", "文件删除检索处理"
      }, {
          // M17N-0008 追加 ここから
          /** 多言語テキスト完了処理 */
          "7108051001", "多语言完成处理"
      }, {
          /** 多言語テキスト初期表示処理 */
          "7108051002", "多语言初期表示处理"
      }, {
          /** 多言語テキスト検索処理 */
          "7108051003", "多语言检索处理"
      }, {
          /** 多言語テキスト更新処理 */
          "7108051004", "多语言更新处理"
      // M17N-0008 追加 ここまで
      },
  };
  
  // 20131028 txw add start
  private static final Object[][] CONTENT = new Object[][] {
    {
        /** 首页TOP内容初始表示处理 */
        "8109011001", "首页TOP内容初始表示处理"
    }, {
        /** 首页TOP内容更新处理 */
        "8109011002", "首页TOP内容更新处理"
    }, {
        /** 首页楼层内容更新处理 */
        "8109021001", "首页楼层内容初始表示处理"
    }, {
        /** 首页楼层内容更新处理 */
        "8109021002", "首页楼层内容更新处理"
    }, {
        /** 首页楼层内容选择表示处理 */
        "8109021003", "首页楼层内容选择表示处理"
    }
  };
  // 20131028 txw add end

  private static final Object[][] OTHER = new Object[][] {
    {
        /** その他共通処理 */
        "9999999999", "其他共通处理"
    },
  };

  @Override
  protected Object[][] getContents() {
    List<Object[]> list = new ArrayList<Object[]>();
    for (Object[] items : COMMON) {
      list.add(items);
    }
    for (Object[] items : ORDER) {
      list.add(items);
    }
    for (Object[] items : CUSTOMER) {
      list.add(items);
    }
    for (Object[] items : CATALOG) {
      list.add(items);
    }
    for (Object[] items : SHOP) {
      list.add(items);
    }
    for (Object[] items : COMMUNICATION) {
      list.add(items);
    }
    for (Object[] items : ANALYSIS) {
      list.add(items);
    }
    for (Object[] items : DATA_IO) {
      list.add(items);
    }
    // 20131028 txw add start
    for (Object[] items : CONTENT) {
      list.add(items);
    }
    // 20131028 txw add end
    for (Object[] items : OTHER) {
      list.add(items);
    }
    Object[][] obj = new Object[list.size()][2];
    for (int i = 0; i < list.size(); i++) {
      Object[] tmp = list.get(i);
      obj[i] = tmp;
    }
    return obj;
  }

}
