package jp.co.sint.webshop.web.log.back;

import java.util.ArrayList;
import java.util.List;
import java.util.ListResourceBundle;

/**
 * 管理側アクセスログに出力するオペレーションコードとアクション名の一覧<br />
 * 本クラスで定義されたオペレーションが管理側アクセスログとして出力される<br />
 * 
 * @author System Integrator Corp.
 */
public class OperationName_zh_TW extends ListResourceBundle {

  private static final Object[][] COMMON = new Object[][] {
      {
          /** ログイン認証処理 */
          "0101011001", "登入認證處理"
      }, {
          /** ログイン初期表示処理 */
          "0101011002", "登入初期表示處理"
      }, {
          /** ダッシュボード初期表示処理 */
          "0101021001", "控制板初期表示處理"
      }, {
          /** ログアウト初期表示処理 */
          "0101031001", "登出初期處理"
      },
  };

  private static final Object[][] ORDER = new Object[][] {
      {
          /** 新規受註登録(商品選択)カート追加処理 */
          "1102011001", "新建訂單(商品選擇)購物車追加處理"
      }, {
          /** 新規受註登録(商品選択)再計算処理 */
          "1102011002", "新建訂單(商品選擇)再計算處理"
      }, {
          /** 新規受註登録(商品選択)カートクリア処理 */
          "1102011003", "新建訂單(商品選擇)購物車清除處理"
      }, {
          /** 新規受註登録(商品選択)初期表示処理 */
          "1102011004", "新建訂單(商品選擇)初期表示處理"
      }, {
          /** 新規受註登録(商品選択)遷移処理 */
          "1102011005", "新建訂單(商品選擇)變遷處理"
      }, {
          /** 新規受註登録(商品選択)カート削除処理 */
          "1102011006", "新建訂單(商品選擇)購物車刪除處理"
      }, {
          /** 新規受註登録(商品選択)検索処理 */
          "1102011007", "新建訂單(商品選擇)檢索處理"
      }, {
          /** 新規受註登録（顧客選択）初期表示処理 */
          "1102012001", "新建訂單（客戶選擇）初期表示處理"
      }, {
          /** 新規受註登録（顧客選択）遷移処理 */
          "1102012002", "新建訂單（客戶選擇）遷移處理"
      }, {
          /** 新規受註登録（顧客選択）検索処理 */
          "1102012003", "新建訂單（客戶選擇）檢索處理"
      }, {
          /** 新規受註登録(配送先設定)配送先追加処理 */
          "1102013001", "新建訂單（客戶選擇）發送處追加處理"
      }, {
          /** 新規受註登録(配送先設定)アドレス追加処理 */
          "1102013002", "新建訂單(配送地設定)地址追加處理"
      }, {
          /** 新規受註登録(配送先設定)再計算処理 */
          "1102013003", "新建訂單(配送地設定)再計算處理"
      }, {
          /** 新規受註登録(配送先設定)初期表示処理 */
          "1102013004", "新建訂單(配送地設定)初期表示處理"
      }, {
          /** 新規受註登録(配送先設定)遷移処理 */
          "1102013005", "新建訂單(配送地設定)變遷處理"
      }, {
          /** 新規受註登録(配送先設定)商品削除処理 */
          "1102013006", "新建訂單(配送地設定)商品刪除處理"
      }, {
          /** 新規受註登録(配送先設定)配送先削除処理 */
          "1102013007", "新建訂單(配送地設定)發送處刪除處理"
      }, {
          /** 新規受註登録(決済方法指定)再計算処理 */
          "1102015001", "新建訂單(結算方法指定)再計算處理"
      }, {
          /** 新規受註登録(決済方法指定)初期表示処理 */
          "1102015002", "新建訂單(結算方法指定)初期表示處理"
      }, {
          /** 新規受註登録(決済方法指定)遷移処理 */
          "1102015003", "新建訂單(結算方法指定)遷移處理"
      }, {
          /** 新規受註登録(確認)初期表示処理 */
          "1102016001", "新建訂單(確認)初期表示處理"
      }, {
          /** 新規受註登録(確認)遷移処理 */
          "1102016002", "新建訂單(確認)遷移處理"
      }, {
          /** 新規受註登録(確認)登録処理 */
          "1102016003", "新建訂單(確認)登錄處理"
      }, {
          /** 新規受註登録(完了畫面)初期表示処理 */
          "1102017001", "新建訂單(完成畫面)初期表示處理"
      }, {
          /** 新規受註登録（顧客登録）戻る処理 */
          "1102019001", "新建訂單（顧客登錄）返回處理"
      }, {
          /** 新規受註登録（顧客登録）確認処理 */
          "1102019002", "新建訂單（顧客登錄）確認處理"
      }, {
          /** 新規受註登録（顧客登録）初期表示処理 */
          "1102019003", "新建訂單（顧客登錄）初期表示處理"
      }, {
          /** 新規受註登録（顧客登録）登録処理 */
          "1102019004", "新建訂單（顧客登錄）登錄處理"
      }, {
          /** 受註入金管理出力処理 */
          "1102021001", "訂單收費管理輸出處理"
      }, {
          /** 受註入金管理初期表示処理 */
          "1102021002", "訂單收費管理初期表示處理"
      }, {
          /** 受註入金管理遷移明細処理 */
          "1102021003", "訂單收費管理變遷明細處理"
      }, {
          /** 受註入金管理支払情報登録処理 */
          "1102021004", "訂單收費管理支付信息登錄處理"
      }, {
          /** 受註入金管理支払情報リセット処理 */
          "1102021005", "訂單收費管理支付信息重置處理"
      }, {
          /** 受註入金管理検索処理 */
          "1102021006", "訂單收費管理檢索處理"
      }, {
          /** 受註入金管理検索戻る処理 */
          "1102021007", "訂單收費管理檢索返回處理"
      }, {
          /** 受註入金管理入金確認メール送信処理 */
          "1102021008", "訂單收費管理入款確認郵件送信處理"
      }, {
          /** 受註入金管理入金督促メール送信処理 */
          "1102021009", "訂單收費管理入款催促郵件送信處理"
      }, {
          /** 受註管理明細受註キャンセル処理 */
          "1102022001", "訂單管理明細訂單取消處理"
      }, {
          /** 受註管理明細入金日クリア処理 */
          "1102022002", "訂單管理明細入款日清除處理"
      }, {
          /** 受註管理明細初期表示処理 */
          "1102022003", "訂單管理明細初期表示處理"
      }, {
          /** 受註管理明細受註修正遷移処理 */
          "1102022004", "訂單管理明細訂單修正遷移處理"
      }, {
          /** 受註管理明細受註返品遷移処理 */
          "1102022005", "訂單管理明細訂單退貨遷移處理"
      }, {
          /** 受註管理明細入金日設定処理 */
          "1102022006", "訂單管理明細入款日設定處理"
      }, {
          /** 受註管理明細更新処理 */
          "1102022007", "訂單管理明細更新處理"
      }, {
          /** 受註修正商品追加処理 */
          "1102023001", "訂單修正商品追加處理"
      }, {
          /** 受註修正商品クリア処理 */
          "1102023002", "訂單修正商品清楚處理"
      }, {
          /** 受註修正再計算処理 */
          "1102023003", "訂單修正再計算處理"
      }, {
          /** 受註修正再計算ポイント処理 */
          "1102023004", "訂單修正再計算積分處理"
      }, {
          /** 受註修正初期表示処理 */
          "1102023005", "訂單修正初期表示處理"
      }, {
          /** 受註修正遷移確認処理 */
          "1102023006", "訂單修正變遷確認處理"
      }, {
          /** 受註修正入金遷移処理 */
          "1102023007", "訂單修正入款變遷處理"
      }, {
          /** 受註修正出荷遷移処理 */
          "1102023008", "訂單修正發貨變遷處理"
      }, {
          /** 受註修正登録処理 */
          "1102023009", "訂單修正登錄處理"
      }, {
          /** 受註返品戻る処理 */
          "1102026001", "訂單退貨返回處理"
      }, {
          /** 受註返品確認処理 */
          "1102026002", "訂單退貨確認處理"
      }, {
          /** 受註返品返品削除処理 */
          "1102026003", "訂單退貨退貨刪除處理"
      }, {
          /** 受註返品初期表示処理 */
          "1102026004", "訂單退貨初期表示處理"
      }, {
          /** 受註返品登録処理 */
          "1102026005", "訂單退貨登錄處理"
      }, {
          /** 出荷管理出荷実績削除処理 */
          "1102041001", "發貨管理發貨實績刪除處理"
      }, {
          /** 出荷管理出荷指示削除処理 */
          "1102041002", "發貨管理發貨指示刪除處理"
      }, {
          /** 出荷管理出力処理 */
          "1102041003", "發貨管理輸出處理"
      }, {
          /** 出荷管理取込処理 */
          "1102041004", "發貨管理取入處理"
      }, {
          /** 出荷管理初期表示処理 */
          "1102041005", "發貨管理初期表示處理"
      }, {
          /** 出荷管理遷移処理 */
          "1102041006", "發貨管理變遷處理"
      }, {
          /** 出荷管理出荷実績登録処理 */
          "1102041007", "發貨管理發貨實績登錄處理"
      }, {
          /** 出荷管理検索処理 */
          "1102041008", "發貨管理檢索處理"
      }, {
          /** 出荷管理検索戻る処理 */
          "1102041009", "發貨管理檢索返回處理"
      }, {
          /** 出荷管理ショップ選択処理 */
          "1102041010", "發貨管理店鋪選擇處理"
      }, {
          /** 出荷管理出荷報告メール送信処理 */
          "1102041011", "發貨管理發貨報告郵件送信處理"
      }, {
          /** 出荷管理明細初期表示処理 */
          "1102042001", "發貨管理明細初期表示處理"
      }, {
          /** 出荷管理明細遷移処理 */
          "1102042002", "發貨管理明細變遷處理"
      }, {
          /** 出荷管理明細出荷指示登録処理 */
          "1102042003", "發貨管理明細發貨指示登錄處理"
      }, {
          /** 出荷管理明細更新処理 */
          "1102042004", "發貨管理明細更新處理"
      },
  };

  private static final Object[][] CUSTOMER = new Object[][] {
      {
          /** 顧客マスタ出力処理 */
          "2103011001", "顧客管理輸出處理"
      }, {
          /** 顧客マスタ初期表示処理 */
          "2103011002", "顧客管理初期表示處理"
      }, {
          /** 顧客マスタ遷移処理 */
          "2103011003", "顧客管理變遷處理"
      }, {
          /** 顧客マスタ検索処理 */
          "2103011004", "顧客管理檢索處理"
      }, {
          /** 顧客マスタ検索戻る処理 */
          "2103011005", "顧客管理檢索返回處理"
      }, {
          /** 顧客マスタ退會処理 */
          "2103011006", "顧客管理退會處理"
      }, {
          /** 顧客登録戻る処理 */
          "2103012001", "顧客登錄返回處理"
      }, {
          /** 顧客登録確認処理 */
          "2103012002", "顧客登錄確認處理"
      }, {
          /** 顧客登録初期表示処理 */
          "2103012003", "顧客登錄初期表示處理"
      }, {
          /** 顧客登録遷移処理 */
          "2103012004", "顧客登錄變遷處理"
      }, {
          /** 顧客登録登録処理 */
          "2103012005", "顧客登錄登錄處理"
      }, {
          /** 顧客登録更新処理 */
          "2103012006", "顧客登錄更新處理"
      }, {
          /** 顧客登録退會処理 */
          "2103012007", "顧客登錄退會處理"
      }, {
          /** ポイント履歴完了処理 */
          "2103014001", "積分履歷完成處理"
      }, {
          /** ポイント履歴削除処理 */
          "2103014002", "積分履歷刪除處理"
      }, {
          /** ポイント履歴初期表示処理 */
          "2103014003", "積分履歷初期表示處理"
      }, {
          /** ポイント履歴登録処理 */
          "2103014004", "積分履歷登錄處理"
      }, {
          /** ポイント履歴検索処理 */
          "2103014005", "積分履歷檢索處理"
      }, {
          /** 註文履歴初期表示処理 */
          "2103015001", "訂購履歷初期表示處理"
      }, {
          /** 註文履歴初期表示戻る処理 */
          "2103015002", "訂購履歷初期表示返回處理"
      }, {
          /** 註文履歴遷移処理 */
          "2103015003", "訂購履歷變遷處理"
      }, {
          /** アドレス帳一覧削除処理 */
          "2103021001", "地址簿一覽刪除處理"
      }, {
          /** アドレス帳一覧初期表示処理 */
          "2103021002", "地址簿一覽初期表示處理"
      }, {
          /** アドレス帳一覧初期表示戻る処理 */
          "2103021003", "地址簿一覽初期表示返回處理"
      }, {
          /** アドレス帳一覧遷移処理 */
          "2103021004", "地址簿一覽變遷處理"
      }, {
          /** アドレス帳登録戻る処理 */
          "2103022001", "地址簿登錄返回處理"
      }, {
          /** アドレス帳登録確認処理 */
          "2103022002", "地址簿登錄確認處理"
      }, {
          /** アドレス帳登録初期表示処理 */
          "2103022003", "地址簿登錄初期表示處理"
      }, {
          /** アドレス帳登録登録処理 */
          "2103022004", "地址簿登錄處理"
      }, {
          /** アドレス帳登録更新処理 */
          "2103022005", "地址簿登錄更新處理"
      }, {
          /** パスワード変更初期表示処理 */
          "2103023001", "密碼變更初期表示處理"
      }, {
          /** パスワード変更更新処理 */
          "2103023002", "密碼變更更新處理"
      }, {
          /** ポイント利用狀況出力処理 */
          "2103031001", "積分利用狀況輸出處理"
      }, {
          /** ポイント利用狀況初期表示処理 */
          "2103031002", "積分利用狀況初期表示處理"
      }, {
          /** ポイント利用狀況検索処理 */
          "2103031003", "積分利用狀況檢索處理"
      }, {
          /** 顧客グループマスタ削除処理 */
          "2103041001", "顧客組管理刪除處理"
      }, {
          /** 顧客グループマスタ初期表示処理 */
          "2103041002", "顧客組管理初期表示處理"
      }, {
          /** 顧客グループマスタ登録処理 */
          "2103041003", "顧客組管理登錄處理"
      }, {
          /** 顧客グループマスタ選択処理 */
          "2103041004", "顧客組管理選擇處理"
      }, {
          /** 顧客グループマスタ更新処理 */
          "2103041005", "顧客組管理更新處理"
      }, {
          /** 顧客屬性マスタ削除処理 */
          "2103051001", "顧客屬性管理刪除處理"
      }, {
          /** 顧客屬性マスタ削除屬性選択処理 */
          "2103051002", "顧客屬性管理刪除屬性選擇處理"
      }, {
          /** 顧客屬性マスタ初期表示処理 */
          "2103051003", "顧客屬性管理初期表示處理"
      }, {
          /** 顧客屬性マスタ新規処理 */
          "2103051004", "顧客屬性管理新規處理"
      }, {
          /** 顧客屬性マスタ登録屬性処理 */
          "2103051005", "顧客屬性管理登錄屬性處理"
      }, {
          /** 顧客屬性マスタ登録屬性選択処理 */
          "2103051006", "顧客屬性管理登錄屬性選擇處理"
      }, {
          /** 顧客屬性マスタ選択処理 */
          "2103051007", "顧客屬性管理選擇處理"
      }, {
          /** 顧客屬性マスタ更新屬性処理 */
          "2103051008", "顧客屬性管理更新屬性處理"
      }, {
          /** 顧客屬性マスタ更新屬性選択処理 */
          "2103051009", "顧客屬性管理更新屬性選擇處理"
      }, {
          /** 情報メール送信戻る処理 */
          "2103061001", "信息郵件送信返回處理"
      }, {
          /** 情報メール送信確認処理 */
          "2103061002", "信息郵件送信確認處理"
      }, {
          /** 情報メール送信初期表示処理 */
          "2103061003", "信息郵件送信初期表示處理"
      }, {
          /** 情報メール送信メール送信処理 */
          "2103061004", "信息郵件送信郵件送信處理"
      }, {
          /** 情報メール送信遷移処理 */
          "2103061005", "信息郵件送信變遷處理"
      }, {
          /** 情報メール送信プレビュー処理 */
          "2103061006", "信息郵件送信印刷處理"
      }, {
          /** 情報メール送信選択処理 */
          "2103061007", "信息郵件送信選擇處理"
      },
  };

  private static final Object[][] CATALOG = new Object[][] {
      {
          /** 商品マスタ削除処理 */
          "3104011001", "商品管理刪除處理"
      }, {
          /** 商品マスタ出力処理 */
          "3104011002", "商品管理輸出處理"
      }, {
          /** 商品マスタ初期表示処理 */
          "3104011003", "商品管理初期表示處理"
      }, {
          /** 商品マスタ遷移処理 */
          "3104011004", "商品管理變遷處理"
      }, {
          /** 商品マスタ検索処理 */
          "3104011005", "商品管理檢索處理"
      }, {
          /** 商品マスタ検索戻る処理 */
          "3104011006", "商品管理檢索返回處理"
      }, {
          /** 商品マスタ更新処理 */
          "3104011007", "商品管理更新處理"
      }, {
          /** 商品登録戻る処理 */
          "3104012001", "商品登錄返回處理"
      }, {
          /** 商品登録キャンセル処理 */
          "3104012002", "商品登錄取消處理"
      }, {
          /** 商品登録確認処理 */
          "3104012003", "商品登錄確認處理"
      }, {
          /** 商品登録初期表示処理 */
          "3104012004", "商品登錄初期表示處理"
      }, {
          /** 商品登録遷移処理 */
          "3104012005", "商品登錄變遷處理"
      }, {
          /** 商品登録プレビュー処理 */
          "3104012006", "商品登錄印刷處理"
      }, {
          /** 商品登録登録処理 */
          "3104012007", "商品登錄登錄處理"
      }, {
          /** 商品登録選択処理 */
          "3104012008", "商品登錄選擇處理"
      }, {
          /** 商品登録更新処理 */
          "3104012009", "商品登錄更新處理"
      }, {
          /** 商品登録畫像削除処理 */
          "3104012010", "商品登錄圖像刪除處理"
      },  {
          //M17N-0008 追加 ここから
          /** 商品多語言跳轉處理 */
          "3104012011", "商品多語言跳轉處理"
          //M17N-0008 追加 ここまで
      }, {
          /** 商品削除確認削除処理 */
          "3104013001", "商品刪除確認刪除處理"
      }, {
          /** 商品削除確認初期表示処理 */
          "3104013002", "商品刪除確認初期表示處理"
      }, {
          /** 商品SKU削除処理 */
          "3104014001", "商品SKU刪除處理"
      }, {
          /** 商品SKU初期表示処理 */
          "3104014002", "商品SKU初期表示處理"
      }, {
          /** 商品SKU遷移処理 */
          "3104014003", "商品SKU變遷處理"
      }, {
          /** 商品SKU価格更新処理 */
          "3104014004", "商品SKU價格更新處理"
      }, {
          /** 商品SKU登録処理 */
          "3104014005", "商品SKU登錄處理"
      }, {
          /** 商品SKU表示処理 */
          "3104014006", "商品SKU表示處理"
      }, {
          /** 商品SKU更新処理 */
          "3104014007", "商品SKU更新處理"
      }, {
          /** 商品SKU規格名稱更新処理 */
          "3104014008", "商品SKU規格名稱更新處理"
      }, {
          /** 商品SKU畫像削除処理 */
          "3104014009", "商品SKU圖像刪除處理"
      }, {
          /** 関連付け完了処理 */
          "3104016001", "關聯完成處理"
      }, {
          /** 関連付け削除処理 */
          "3104016002", "關聯刪除處理"
      }, {
          /** 関連付け初期表示処理 */
          "3104016003", "關聯初期表示處理"
      }, {
          /** 関連付け登録処理 */
          "3104016004", "關聯登錄處理"
      }, {
          /** 関連付け検索処理 */
          "3104016005", "關聯檢索處理"
      }, {
          /** 関連付け更新処理 */
          "3104016006", "關聯更新處理"
      }, {
          /** 関連付け一覧初期表示処理 */
          "3104017001", "關聯一覽初期表示處理"
      }, {
          /** 関連付け一覧登録処理 */
          "3104017002", "關聯一覽登錄處理"
      }, {
          //M17N-0008 追加 ここから
          /** 商品テキスト完了処理 */
          "3104018001", "商品多語言完成處理"
      }, {
          /** 商品テキスト初期表示処理 */
          "3104018002", "商品多語言初期表示處理"
      }, {
          /** 商品テキスト検索処理 */
          "3104018003", "商品多語言檢索處理"
      }, {
          /** 商品テキスト更新処理 */
          "3104018004", "商品多語言更新處理"
          //M17N-0008 追加 ここまで
      // 2012/11/21 促销对应 ob add start
      }, {
          /** セット品設定初期化処理 */
          "3104019001", "套餐設定初期表示處理"
      }, {
          /** セット品明細登録処理 */
          "3104019002", "套餐明細登錄處理"
      }, {
          /** セット品明細削除処理 */
          "3104019003", "套餐明細刪除處理"
	  // 2012/11/21 促销对应 ob add end
      }, {
          /** カテゴリマスタ削除処理 */
          "3104021001", "類別管理刪除處理"
      }, {
          /** カテゴリマスタ屬性削除処理 */
          "3104021002", "類別管理屬性刪除處理"
      }, {
          /** カテゴリマスタ初期表示処理 */
          "3104021003", "類別管理初期表示處理"
      }, {
          /** カテゴリマスタ遷移処理 */
          "3104021004", "類別管理變遷處理"
      }, {
          /** カテゴリマスタ登録処理 */
          "3104021005", "類別管理登錄處理"
      }, {
          /** カテゴリマスタ選択処理 */
          "3104021006", "類別管理選擇處理"
      }, {
          /** カテゴリマスタ更新処理 */
          "3104021007", "類別管理更新處理"
      }, {
          /** カテゴリ－商品関連付け削除処理 */
          "3104022001", "類別－商品關聯刪除處理"
      }, {
          /** カテゴリ－商品関連付け初期表示処理 */
          "3104022002", "類別－商品關聯初期表示處理"
      }, {
          /** カテゴリ－商品関連付け登録処理 */
          "3104022003", "類別－商品關聯登錄處理"
      }, {
          /** カテゴリ－商品関連付け検索処理 */
          "3104022004", "類別－商品關聯檢索處理"
      }, {
          /** カテゴリ－商品関連付け選択処理 */
          "3104022005", "類別－商品關聯選擇處理"
      }, {
          /** カテゴリ－商品関連付け更新処理 */
          "3104022006", "類別－商品關聯更新處理"
      }, {
          /** カテゴリツリー関連付け初期表示処理 */
          "3104023001", "類別樹關聯初期表示處理"
      }, {
          /** カテゴリツリー関連付け登録処理 */
          "3104023002", "類別樹關聯登錄處理"
      }, {
          /** ギフトマスタ削除処理 */
          "3104031001", "禮物管理刪除處理"
      }, {
          /** ギフトマスタ初期表示処理 */
          "3104031002", "禮物管理初期表示處理"
      }, {
          /** ギフトマスタ遷移処理 */
          "3104031003", "禮物管理變遷處理"
      }, {
          /** ギフトマスタ登録処理 */
          "3104031004", "禮物管理登錄處理"
      }, {
          /** ギフトマスタ検索処理 */
          "3104031005", "禮物管理檢索處理"
      }, {
          /** ギフトマスタ選択処理 */
          "3104031006", "禮物管理選擇處理"
      }, {
          /** ギフトマスタ更新処理 */
          "3104031007", "禮物管理更新處理"
      }, {
          /** タグマスタ完了処理 */
          "3104041001", "標記管理完成處理"
      }, {
          /** タグマスタ削除処理 */
          "3104041002", "標記管理刪除處理"
      }, {
          /** タグマスタ初期表示処理 */
          "3104041003", "標記管理初期表示處理"
      }, {
          /** タグマスタ遷移処理 */
          "3104041004", "標記管理變遷處理"
      }, {
          /** タグマスタ登録処理 */
          "3104041005", "標記管理登錄處理"
      }, {
          /** タグマスタ検索処理 */
          "3104041006", "標記管理檢索處理"
      }, {
          /** タグマスタ検索戻る処理 */
          "3104041007", "標記管理檢索返回處理"
      }, {
          /** タグマスタ選択処理 */
          "3104041008", "標記管理選擇處理"
      }, {
          /** タグマスタ更新処理 */
          "3104041009", "標記管理更新處理"
      }, {
          /** 入出庫管理完了処理 */
          "3104051001", "出入庫管理完成處理"
      }, {
          /** 入出庫管理初期表示処理 */
          "3104051002", "出入庫管理初期表示處理"
      }, {
          /** 入出庫管理登録処理 */
          "3104051003", "出入庫管理登錄處理"
      }, {
          /** 入出庫管理検索処理 */
          "3104051004", "出入庫管理檢索處理"
      }, {
          /** 在庫狀況設定削除処理 */
          "3104061001", "庫存狀況設定刪除處理"
      }, {
          /** 在庫狀況設定初期表示処理 */
          "3104061002", "庫存狀況設定初期表示處理"
      }, {
          /** 在庫狀況設定登録処理 */
          "3104061003", "庫存狀況設定登錄處理"
      }, {
          /** 在庫狀況設定検索処理 */
          "3104061004", "庫存狀況設定檢索處理"
      }, {
          /** 在庫狀況設定選択処理 */
          "3104061005", "庫存狀況設定選擇處理"
      }, {
          /** 在庫狀況設定更新処理 */
          "3104061006", "庫存狀況設定更新處理"
      }, {
          /** 入荷お知らせ削除処理 */
          "3104071001", "到貨通知刪除處理"
      }, {
          /** 入荷お知らせ出力処理 */
          "3104071002", "到貨通知輸出處理"
      }, {
          /** 入荷お知らせ初期表示処理 */
          "3104071003", "到貨通知初期表示處理"
      }, {
          /** 入荷お知らせ検索処理 */
          "3104071004", "到貨通知檢索處理"
      }, {
          /** 商品詳細レイアウト完了処理 */
          "3104081001", "商品詳細布局完成處理"
      }, {
          /** 商品詳細レイアウト初期表示処理 */
          "3104081002", "商品詳細布局初期表示處理"
      }, {
          /** 商品詳細レイアウト登録処理 */
          "3104081003", "商品詳細布局登錄處理"
      }, {
          /** 商品詳細レイアウトリセット処理 */
          "3104081004", "商品詳細布局重置處理"
      }, {
          /** 商品詳細レイアウト検索処理 */
          "3104081005", "商品詳細布局檢索處理"
      },
  };

  private static final Object[][] SHOP = new Object[][] {
      {
          /** サイト設定戻る処理 */
          "4105011001", "網站設定返回處理"
      }, {
          /** サイト設定確認処理 */
          "4105011002", "網站設定確認處理"
      }, {
          /** サイト設定初期表示処理 */
          "4105011003", "網站設定初期表示處理"
      }, {
          /** サイト設定登録処理 */
          "4105011004", "網站設定登錄處理"
      }, {
          /** ショップマスタ編集処理 */
          "4105021001", "店鋪管理編集處理"
      }, {
          /** ショップマスタ初期表示処理 */
          "4105021002", "店鋪管理初期表示處理"
      }, {
          /** ショップマスタ検索処理 */
          "4105021003", "店鋪管理檢索處理"
      }, {
          /** ショップマスタ検索戻る処理 */
          "4105021004", "店鋪管理檢索返回處理"
      }, {
          /** ショップ登録戻る処理 */
          "4105022001", "店鋪登錄返回處理"
      }, {
          /** ショップ登録確認処理 */
          "4105022002", "店鋪登錄確認處理"
      }, {
          /** ショップ登録削除処理 */
          "4105022003", "店鋪登錄刪除處理"
      }, {
          /** ショップ登録初期表示処理 */
          "4105022004", "店鋪登錄初期表示處理"
      }, {
          /** ショップ登録登録処理 */
          "4105022005", "店鋪登錄登錄處理"
      }, {
          /** ショップ登録遷移処理 */
          "4105022006", "店鋪登錄變遷處理"
      }, {
          /** ショップ登録更新処理 */
          "4105022007", "店鋪登錄更新處理"
      }, {
          /** ショップマスタ削除確認キャンセル処理 */
          "4105024001", "店鋪管理刪除確認取消處理"
      }, {
          /** ショップマスタ削除確認削除処理 */
          "4105024002", "店鋪管理刪除確認刪除處理"
      }, {
          /** ショップマスタ削除確認初期表示処理 */
          "4105024003", "店鋪管理刪除確認初期表示處理"
      }, {
          /** ポイントルール初期表示処理 */
          "4105031001", "積分規則初期表示處理"
      }, {
          /** ポイントルール登録処理 */
          "4105031002", "積分規則登錄處理"
      }, {
          /** 消費稅マスタ削除処理 */
          "4105041001", "消費稅管理刪除處理"
      }, {
          /** 消費稅マスタ初期表示処理 */
          "4105041002", "消費稅管理初期表示處理"
      }, {
          /** 消費稅マスタ登録処理 */
          "4105041003", "消費稅管理登錄處理"
      }, {
          /** 支払方法設定手數料削除処理 */
          "4105051001", "支付方法設定手續費刪除處理"
      }, {
          /** 支払方法設定支払方法削除処理 */
          "4105051002", "支付方法設定支付方法刪除處理"
      }, {
          /** 支払方法設定初期表示処理 */
          "4105051003", "支付方法設定初期表示處理"
      }, {
          /** 支払方法設定遷移編集処理 */
          "4105051004", "支付方法設定變遷編集處理"
      }, {
          /** 支払方法設定支払情報処理 */
          "4105051005", "支付方法設定支付信息處理"
      }, {
          /** 支払方法設定登録支払手數料処理 */
          "4105051006", "支付方法設定登錄支付手續費處理"
      }, {
          /** 支払方法設定更新支払手數料処理 */
          "4105051007", "支付方法設定更新支付手續費處理"
      }, {
          /** 支払方法詳細初期表示処理 */
          "4105052001", "支付方法詳細初期表示處理"
      }, {
          /** 支払方法詳細金融機関設定遷移処理 */
          "4105052002", "支付方法詳細金融機關設定變遷處理"
      }, {
          /** 支払方法詳細登録処理 */
          "4105052003", "支付方法詳細登錄處理"
      }, {
          /** 金融機関設定削除処理 */
          "4105053001", "金融機關設定刪除處理"
      }, {
          /** 金融機関設定初期表示処理 */
          "4105053002", "金融機關設定初期表示處理"
      }, {
          /** 金融機関設定登録処理 */
          "4105053003", "金融機關設定登錄處理"
      }, {
          /** 金融機関設定選択処理 */
          "4105053004", "金融機關設定選擇處理"
      }, {
          /** 配送・送料設定配送種別削除処理 */
          "4105061001", "發送·運費設定發送種別刪除處理"
      }, {
          /** 配送・送料設定配送指定時間削除処理 */
          "4105061002", "發送·運費設定發送指定時間刪除處理"
      }, {
          /** 配送・送料設定初期表示処理 */
          "4105061003", "發送·運費設定初期表示處理"
      }, {
          /** 配送・送料設定配送指定時間登録処理 */
          "4105061004", "發送·運費設定發送指定時間登錄處理"
      }, {
          /** 配送・送料設定遷移処理 */
          "4105061005", "發送·運費設定變遷處理"
      }, {
          /** 配送・送料設定配送指定時間表示処理 */
          "4105061006", "發送·運費設定發送指定時間表是處理"
      }, {
          /** 配送・送料設定配送指定時間更新処理 */
          "4105061007", "發送·運費設定發送指定時間更新處理"
      }, {
          /** 配送種別設定明細削除処理 */
          "4105062001", "發送種別設定明細刪除處理"
      }, {
          /** 配送種別設定明細初期表示処理 */
          "4105062002", "發送種別設定明細初期表示處理"
      }, {
          /** 配送種別設定明細登録処理 */
          "4105062003", "發送種別設定明細登錄處理"
      }, {
          /** 配送種別設定明細更新処理 */
          "4105062004", "發送種別設定明細更新處理"
      }, {
          /** カレンダーマスタ初期表示処理 */
          "4105071001", "日歷管理初期表示處理"
      }, {
          /** カレンダーマスタ登録処理 */
          "4105071002", "日歷管理登錄處理"
      }, {
          /** 地域ブロック設定削除処理 */
          "4105081001", "地域塊設定刪除處理"
      }, {
          /** 地域ブロック設定初期表示処理 */
          "4105081002", "地域塊設定初期表示處理"
      }, {
          /** 地域ブロック設定登録処理 */
          "4105081003", "地域塊設定登錄處理"
      }, {
          /** 地域ブロック設定登録都道府県処理 */
          "4105081004", "地域ブロック設定登錄都道府縣處理"
      }, {
          /** 地域ブロック設定更新処理 */
          "4105081005", "地域ブロック設定更新處理"
      }, {
          /** 管理ユーザマスタ削除処理 */
          "4105091001", "管理用戶管理刪除處理"
      }, {
          /** 管理ユーザマスタ初期表示処理 */
          "4105091002", "管理用戶管理初期表示處理"
      }, {
          /** 管理ユーザマスタ遷移処理 */
          "4105091003", "管理用戶管理變遷處理"
      }, {
          /** 管理ユーザマスタ検索処理 */
          "4105091004", "管理用戶管理檢索處理"
      }, {
          /** 管理ユーザマスタ明細戻る処理 */
          "4105092001", "管理用戶管理明細返回處理"
      }, {
          /** 管理ユーザマスタ明細確認処理 */
          "4105092002", "管理用戶管理明細確認處理"
      }, {
          /** 管理ユーザマスタ明細初期表示処理 */
          "4105092003", "管理用戶管理明細初期表示處理"
      }, {
          /** 管理ユーザマスタ明細登録処理 */
          "4105092004", "管理用戶管理明細登錄處理"
      }, {
          /** 管理ユーザマスタ明細更新処理 */
          "4105092005", "管理用戶管理明細更新處理"
      }, {
          /** 管理側アクセスログ初期表示処理 */
          "4105094001", "管理方面訪問日誌初期表示處理"
      }, {
          /** 管理側アクセスログ検索処理 */
          "4105094002", "管理方面訪問日誌檢索處理"
      }, {
          /** メールテンプレート情報メール削除処理 */
          "4105111001", "郵件模板信息郵件刪除處理"
      }, {
          /** メールテンプレート初期表示処理 */
          "4105111002", "郵件模板初期表示處理"
      }, {
          /** メールテンプレート情報メール登録処理 */
          "4105111003", "郵件模板信息郵件登錄處理"
      }, {
          /** メールテンプレートプレビュー処理 */
          "4105111004", "郵件模板印刷處理"
      }, {
          /** メールテンプレート登録処理 */
          "4105111005", "郵件模板登錄處理"
      }, {
          /** メールテンプレート登録プレビュー処理 */
          "4105111006", "郵件模板登錄印刷處理"
      }, {
          /** メールテンプレートメールタイプ選択処理 */
          "4105111007", "郵件模板郵件類型選擇處理"
      }, {
          /** お知らせ編集削除処理 */
          "4105121001", "通知編集刪除處理"
      }, {
          /** お知らせ編集初期表示処理 */
          "4105121002", "通知編集初期表示處理"
      }, {
          /** お知らせ編集登録処理 */
          "4105121003", "通知編集登錄處理"
      }, {
          /** お知らせ編集選択処理 */
          "4105121004", "通知編集選擇處理"
      },
  };

  private static final Object[][] COMMUNICATION = new Object[][] {
      {
          /** アンケート管理削除処理 */
          "5106011001", "咨詢調查管理刪除處理"
      }, {
          /** アンケート管理初期表示処理 */
          "5106011002", "咨詢調查管理初期表示處理"
      }, {
          /** アンケート管理遷移処理 */
          "5106011003", "咨詢調查管理變遷處理"
      }, {
          /** アンケート管理検索処理 */
          "5106011004", "咨詢調查管理檢索處理"
      }, {
          /** アンケート管理検索戻る処理 */
          "5106011005", "咨詢調查管理檢索返回處理"
      }, {
          /** アンケートマスタ変更設問処理 */
          "5106012001", "咨詢調查管理變更設問處理"
      }, {
          /** アンケートマスタ削除選択処理 */
          "5106012002", "咨詢調查管理刪除選擇處理"
      }, {
          /** アンケートマスタ削除設問処理 */
          "5106012003", "咨詢調查管理刪除設問處理"
      }, {
          /** アンケートマスタ明細処理 */
          "5106012004", "咨詢調查管理明細處理"
      }, {
          /** アンケートマスタ初期表示処理 */
          "5106012005", "咨詢調查管理初期表示處理"
      }, {
          /** アンケートマスタ新規選択処理 */
          "5106012006", "咨詢調查管理新規選擇處理"
      }, {
          /** アンケートマスタ登録基礎処理 */
          "5106012007", "咨詢調查管理登錄基礎處理"
      }, {
          /** アンケートマスタ登録選択処理 */
          "5106012008", "咨詢調查管理登錄選擇處理"
      }, {
          /** アンケートマスタ登録設問処理 */
          "5106012009", "咨詢調查管理登錄設問處理"
      }, {
          /** アンケートマスタ選択選択処理 */
          "5106012010", "咨詢調查管理選擇選擇處理"
      }, {
          /** アンケートマスタ選択設問処理 */
          "5106012011", "咨詢調查管理選擇設問處理"
      }, {
          /** アンケートマスタ更新基礎処理 */
          "5106012012", "咨詢調查管理更新基礎處理"
      }, {
          /** アンケートマスタ更新選択処理 */
          "5106012013", "咨詢調查管理更新選擇處理"
      }, {
          /** アンケートマスタ更新設問処理 */
          "5106012014", "咨詢調查管理更新設問處理"
      }, {
          /** アンケート分析出力処理 */
          "5106013001", "咨詢調查分析輸出處理"
      }, {
          /** アンケート分析初期表示処理 */
          "5106013002", "咨詢調查分析初期表示處理"
      }, {
          /** レビュー管理削除処理 */
          "5106021001", "評論管理刪除處理"
      }, {
          /** レビュー管理初期表示処理 */
          "5106021002", "評論管理初期表示處理"
      }, {
          /** レビュー管理遷移処理 */
          "5106021003", "評論管理變遷處理"
      }, {
          /** レビュー管理検索処理 */
          "5106021004", "評論管理檢索處理"
      }, {
          /** レビュー管理検索戻る処理 */
          "5106021005", "評論管理檢索返回處理"
      }, {
          /** レビュー管理更新処理 */
          "5106021006", "評論管理更新處理"
      }, {
          /** キャンペーン管理削除処理 */
          "5106031001", "活動管理刪除處理"
      }, {
          /** キャンペーン管理初期表示処理 */
          "5106031002", "活動管理初期表示處理"
      }, {
          /** キャンペーン管理遷移処理 */
          "5106031003", "活動管理變遷處理"
      }, {
          /** キャンペーン管理検索処理 */
          "5106031004", "活動管理檢索處理"
      }, {
          /** キャンペーン管理検索戻る処理 */
          "5106031005", "活動管理檢索返回處理"
      }, {
          /** キャンペーンマスタ初期表示処理 */
          "5106032001", "活動管理初期表示處理"
      }, {
          /** キャンペーンマスタ遷移処理 */
          "5106032002", "活動管理變遷處理"
      }, {
          /** キャンペーンマスタ登録処理 */
          "5106032003", "活動管理登錄處理"
      }, {
          /** キャンペーン分析出力処理 */
          "5106034001", "活動分析輸出處理"
      }, {
          /** キャンペーン分析初期表示処理 */
          "5106034002", "活動分析初期表示處理"
      }, {
          /** メールマガジンマスタ削除処理 */
          "5106041001", "郵件雜誌管理刪除處理"
      }, {
          /** メールマガジンマスタ出力処理 */
          "5106041002", "郵件雜誌管理輸出處理"
      }, {
          /** メールマガジンマスタ初期表示処理 */
          "5106041003", "郵件雜誌管理初期表示處理"
      }, {
          /** メールマガジンマスタ登録処理 */
          "5106041004", "郵件雜誌管理登錄處理"
      }, {
          /** メールマガジンマスタ選択処理 */
          "5106041005", "郵件雜誌管理選擇處理"
      }, {
          /** メールマガジンマスタ更新処理 */
          "5106041006", "郵件雜誌管理更新處理"
      }, {
      // 2012/11/21 促销对应 ob add start	  
          /** キャンペーン管理初期表示処理 */
          "5106101001", "促銷活動管理初期表示處理"
      }, {
          /** キャンペーン管理遷移処理 */
          "5106101002", "促銷活動管理變遷處理"
      }, {
          /** キャンペーン管理検索処理 */
          "5106101003", "促銷活動管理檢索處理"
      }, {
          /** キャンペーン管理検索戻る処理 */
          "5106101004", "促銷活動管理檢索返回處理"
      }, {
          /** キャンペーン管理削除処理 */
          "5106101005", "促銷活動管理刪除處理"
      }, {
    	  /** キャンペーンマスタ初期表示処理 */
          "5106102001", "促銷活動編輯畫面初期表示處理"
      }, {
          /** キャンペーンマスタ登録処理 */
          "5106102002", "促銷活動編輯畫面登錄處理"
      }, {
          /** キャンペーンマスタ更新処理 */
          "5106102003", "促銷活動編輯畫面更新處理"
      }, {
          /** キャンペーンマスタ条件設定処理 */
          "5106102004", "促銷活動編輯畫面促銷條件設定處理"
      }, {
         /** キャンペーンマスタ行為設定処理 */
          "5106102005", "促銷活動編輯畫面促銷行爲設定處理"
      }, {
         /** キャンペーンマスタ行為設定処理 */
         "5106102006", "促銷活動編輯畫面變遷處理"
      }
      // 2012/11/21 促销对应 ob add end
  };

  private static final Object[][] ANALYSIS = new Object[][] {
      {
          /** アクセスログ集計出力処理 */
          "6107011003", "訪問日誌集計數出處理"
      }, {
          /** アクセスログ集計初期表示処理 */
          "6107011004", "訪問日誌集計初期表示處理"
      }, {
          /** アクセスログ集計遷移処理 */
          "6107011005", "訪問日誌集計變遷處理"
      }, {
          /** アクセスログ集計検索処理 */
          "6107011006", "訪問日誌集計檢索處理"
      }, {
          /** リファラー集計出力処理 */
          "6107013001", "參照集計數出處理"
      }, {
          /** リファラー集計初期表示処理 */
          "6107013002", "參照集計初期表示處理"
      }, {
          /** リファラー集計検索処理 */
          "6107013003", "參照集計檢索處理"
      }, {
          /** 商品別アクセスログ集計出力処理 */
          "6107021001", "按商品訪問日誌集計輸出處理"
      }, {
          /** 商品別アクセスログ集計初期表示処理 */
          "6107021002", "按商品訪問日誌集計初期表示處理"
      }, {
          /** 商品別アクセスログ集計検索処理 */
          "6107021003", "按商品訪問日誌集計檢索處理"
      }, {
          /** 顧客嗜好分析出力処理 */
          "6107031001", "顧客嗜好分析輸出處理"
      }, {
          /** 顧客嗜好分析初期表示処理 */
          "6107031002", "顧客嗜好分析初期表示處理"
      }, {
          /** 顧客嗜好分析検索処理 */
          "6107031003", "顧客嗜好分析檢索處理"
      }, {
          /** 顧客嗜好分析選択処理 */
          "6107031004", "顧客嗜好分析選擇處理"
      }, {
          /** 顧客分析初期表示処理 */
          "6107051001", "顧客分析初期表示處理"
      }, {
          /** RFM分析出力処理 */
          "6107071001", "RFM分析輸出處理"
      }, {
          /** RFM分析初期表示処理 */
          "6107071002", "RFM分析初期表示處理"
      }, {
          /** RFM分析検索処理 */
          "6107071003", "RFM分析檢索處理"
      }, {
          /** ショップ別売上集計出力処理 */
          "6107081001", "按店鋪銷售額集計數出處理"
      }, {
          /** ショップ別売上集計初期表示処理 */
          "6107081002", "按店鋪銷售額集計初期表示處理"
      }, {
          /** ショップ別売上集計遷移処理 */
          "6107081003", "按店鋪銷售額集計變遷處理"
      }, {
          /** ショップ別売上集計検索処理 */
          "6107081004", "按店鋪銷售額集計檢索處理"
      }, {
          /** ショップ別売上集計検索戻る処理 */
          "6107081005", "按店鋪銷售額集計檢索返回處理"
      }, {
          /** 売上集計出力処理 */
          "6107082001", "銷售額集計輸出處理"
      }, {
          /** 売上集計初期表示処理 */
          "6107082002", "銷售額集計初期表示處理"
      }, {
          /** 売上集計検索処理 */
          "6107082003", "銷售額集計檢索處理"
      }, {
          /** 商品別売上集計出力処理 */
          "6107083001", "按商品銷售額集計輸出處理"
      }, {
          /** 商品別売上集計初期表示処理 */
          "6107083002", "按商品銷售額集計初期表示處理"
      }, {
          /** 商品別売上集計検索処理 */
          "6107083003", "按商品銷售額集計檢索處理"
      }, {
          /** 検索キーワード集計出力処理 */
          "6107091001", "檢索關鍵字集計數出處理"
      }, {
          /** 検索キーワード集計初期表示処理 */
          "6107091002", "檢索關鍵字集計初期表示處理"
      }, {
          /** 検索キーワード集計検索処理 */
          "6107091003", "檢索關鍵字集計檢索處理"
      },
  };

  private static final Object[][] DATA_IO = new Object[][] {
      {
          /** データ一括出力出力処理 */
          "7108011001", "數據一起輸出輸出處理"
      }, {
          /** データ一括出力初期表示処理 */
          "7108011002", "數據一起輸出初期表示處理"
      }, {
          /** データ一括取込完了処理 */
          "7108021001", "數據一起取入完成處理"
      }, {
          /** データ一括取込初期表示処理 */
          "7108021002", "數據一起取入初期表示處理"
      }, {
          /** ファイルアップロード完了処理 */
          "7108031001", "文件上傳完了處理"
      }, {
          /** ファイルアップロード初期表示処理 */
          "7108031002", "文件上傳初期表示處理"
      }, {
          /** ファイルアップロード検索処理 */
          "7108031003", "文件上傳檢索處理"
      }, {
          /** ファイル削除削除処理 */
          "7108041001", "文件刪除處理"
      }, {
          /** ファイル削除初期表示処理 */
          "7108041002", "文件刪除初期表示處理"
      }, {
          /** ファイル削除検索処理 */
          "7108041003", "文件刪除檢索處理"
      }, {
          //M17N-0008 追加 ここから
          /** 多言語テキスト完了処理 */
          "7108051001", "多語言完成處理"
      }, {
          /** 多言語テキスト初期表示処理 */
          "7108051002", "多語言初期表示處理"
      }, {
          /** 多言語テキスト検索処理 */
          "7108051003", "多語言檢索處理"
      }, {
          /** 多言語テキスト更新処理 */
          "7108051004", "多語言更新處理"
         //M17N-0008 追加 ここまで
      },
  };

  private static final Object[][] OTHER = new Object[][] {
    {
        /** その他共通処理 */
        "9999999999", "其他共通處理"
    },
  };

  @Override
  protected Object[][] getContents() {
    List<Object[]> list = new ArrayList<Object[]>();
    for (Object[] items : COMMON) {
      list.add(items);
    }
    for (Object[] items : ORDER) {
      list.add(items);
    }
    for (Object[] items : CUSTOMER) {
      list.add(items);
    }
    for (Object[] items : CATALOG) {
      list.add(items);
    }
    for (Object[] items : SHOP) {
      list.add(items);
    }
    for (Object[] items : COMMUNICATION) {
      list.add(items);
    }
    for (Object[] items : ANALYSIS) {
      list.add(items);
    }
    for (Object[] items : DATA_IO) {
      list.add(items);
    }
    for (Object[] items : OTHER) {
      list.add(items);
    }
    Object[][] obj = new Object[list.size()][2];
    for (int i = 0; i < list.size(); i++) {
      Object[] tmp = list.get(i);
      obj[i] = tmp;
    }
    return obj;
  }

}
